<?php

/*Game resources*/

//■ 空手武器 ■
$nowep = '拳头';

//■ 无防具 ■
$noarb = '内衣';
//■ 无道具 ■
$noitm = '--';
//■ 无限耐久度 ■
$nosta = '∞';
//■ 无属性 ■
$nospk = '--';
//■ 多种类武器 ■
$mltwk = '泛用兵器';
//■ 多重属性 ■
//$mltspk = '多重属性';


//游戏状态描述
$gstate = Array(0 => '<font color="grey">已结束</font>',10 => '即将开始',20 => '开放激活',30 => '人数已满',40=> '<font color="yellow">连斗中</font>',50=>'<font color="red">死斗中</font>',60=>'<font color="red">紧急状态！</font>');
$gwin = Array(0 => '程序故障', 1 => '全部死亡',2 => '最后幸存',3 => '锁定解除',4 => '无人参加',5 => '核爆全灭',6 => 'GM中止',7=>'幻境解离',8=>'幻境重构',9=>'黄鸡风暴',10=>'幻境重启');
$week = Array('日','一','二','三','四','五','六');
$clubinfo = Array(
	0=>'无',
	1=>'街头霸王',
	2=>'见敌必斩',
	3=>'灌篮高手',
	4=>'狙击鹰眼',
	5=>'拆弹专家',
	6=>'宛如疾风',
	7=>'锡安成员',
	8=>'黑衣组织',
	9=>'超能力者',
	10=>'高速成长',
	11=>'富家子弟',
	12=>'全能骑士',
	13=>'根性兄贵',
	14=>'健美兄贵',
	15=>'<span class="L5">L5状态</span>',
	16=>'全能骑士',
	17=>'走路萌物',
	18=>'天赋异禀',
	19=>'踏雪无痕',
	20=>'宝石骑士',
	21=>'恐怖份子',
	22=>'钢铁意志',
	23=>'铁拳无敌',
	24=>'亡灵骑士',
	25=>'怪物猎人',
	26=>'谈笑风生',
	27=>'迷之称号',
	28=>'零之使魔',
	49=>'奥秘学者',
	50=>'下位之灵',
	51=>'中位之灵',
	52=>'上位之灵',
	53=>'伟大秘仪',
	70=>'偶像大师',
	97=>'铁血战士',
	98=>'换装迷宫',
	99=>'亡灵骑士'
	);
$wthinfo = Array('晴天','大晴','多云','小雨','暴雨','台风','雷雨','下雪','起雾','浓雾','<span class="yellow">瘴气</span>','<span class="red">龙卷风</span>','<span class="clan">暴风雪</span>','<span class="blue">冰雹</span>','<span class="linen">离子暴</span>','<span class="green">辐射尘</span>','<span class="purple">臭氧洞</span>');
$sexinfo = Array(0=> '未定', 'm' => '男生', 'f' => '女生');
$hpinfo = Array('并无大碍','伤痕累累','生命危险','已经死亡');
$spinfo = Array('精力充沛','略有疲惫','精疲力尽','已经死亡');
$rageinfo = Array('平静','愤怒','暴怒','已经死亡');
$wepeinfo = Array('不值一提','略有威胁','威力可观','无敌神器');
$poseinfo = Array('通常','作战姿态','强袭姿态','探物姿态','偷袭姿态','治疗姿态','神闪姿态');
$tacinfo = Array('通常','','重视防御','重视反击','重视躲避');
$typeinfo = Array(
	0=>'学生',
	1=>'组织头目',
	2=>'监察员',
	3=>'不思议',//原本打算活动用，暂时放置
	//3=>'',//已经没用的类别
	//4=>'拟似意识',
	//5=>'杏仁豆腐',
	//6=>'黑幕',
	//7=>'幻影执行官',
	//8=>'管理员',//已经没用的类别
	//9=>'？？？？',
	//10=>'',//特殊BOSS【未名存在】
	11=>'管束外人员',//杀戮巫女
	12=>'深渊之民',
	13=>'管束外人员',//亚莉丝
	14=>'具象投影',
	//15=>'',//已被静流占用，不可修改
	16=>'GHost9',
	17=>'深渊灾厄',
	//20=>'英雄',
	//21=>'武神',
	//22=>'天神',
	//24=>'游动萌物',
	25=>'佣兵',
	//30=>'代码聚合体',
	//31=>'代码聚合体',
	//32=>'代码聚合体',
	//33=>'管理员',//英雄模式的BOSS
	40=>'卷入事件的无辜人员',//诊所众
	41=>'巫女',//巫女众
	42=>'班主任',//任林田
	43=>'研究员',
	//44=>'非作战人员',
	//45=>'电波幽灵',
	//87=>'夜种',
	//88=>'■■',
	89=>'士兵',
	90=>'克隆士兵',//量产无聊
	91=>'野生动物'
	);//最后一项不需要带逗号
	
$xiconlist = Array(
	//特定玩家才可以选择的专属头像
	'玩家ID' => Array(
			0 => '你的頭像數字，注意男女問題',
	),
	'亚莉丝' => Array(
			0 => '255',
	),
);
	
$killmsginfo = Array(
	0=>'',
	1=>'任务完结。',
	2=>'猎杀任务执行中。',
	//3=>'你弱爆了！',
	4=>'………………',
	5=>'记住，轻敌可是会死的。',
	6=>'忘记历史就意味着背叛，背叛就意味着……死亡。',
	7=>'你的实力还远远不及董事长的脚根呢。',
	8=>'死吧。',
	9=>'MISSION COMPLETE',
	10=>'这是我必须做的事，给您添麻烦了……',
	11=>'再度血祭。',
	12=>'',
	13=>'呜哇！走开啦！',
	14=>'滋滋……（信号音）',
	14=>'死吧。',
	15=>'',
	40=>'麻烦事真多……',
	43=>'这也是收集数据的一环吧。',
	44=>'啊……对不起！对不起！',
	89=>'真弱。',
	90=>'你弱爆了！'
	);
$stateinfo = Array
(
	0 => '正常存活',
	1 => '睡眠状态',
	2 => '治疗状态',
	3 => '静养状态',
	5 => '最后幸存',
	6 => '解除禁区',
	10 => '莫名身亡',
	11 => '禁区停留',
	12 => '毒发身亡',
	13 => '意外死亡',
	14 => '入侵失败', 
	15 => '黑幕抹杀', 
	16 => '黑幕抹杀', 
	17 => '遭遇天灾',
	18 => '烧伤不治', 
	19 => '失血过多',
	20 => '玩家杀害', 
	21 => '玩家杀害', 
	22 => '玩家杀害', 
	23 => '玩家杀害', 
	24 => '玩家杀害', 
	25 => '玩家杀害', 
	26 => '误食毒物', 
	27 => '误触陷阱', 
	28 => '死亡笔记',
	29 => '玩家杀害', 
	30 => '误触机关', 
	31 => 'L5病发', 
	32 => '挂机受罚', 
	33 => '天降软妹，无福消受', 
	34 => '溶剂作用', 
	35 => '救济',
	36 => '惨遭腰斩', 
	37 => '身首异处', 
	38 => '业火灼烧', 
	39 => '武器反噬', 
	40 => '御柱坠落', 
	41 => '武器反噬', 
	42 => '自杀袭击', 
	43 => '自爆身亡', 
	44 => '改装失误', 
	45 => '核弹袭击',
	46 => '鱼弹袭击',
	47 => '诅咒反噬',
	48 => '脱离战场',
);

$lwinfo = Array(
	0 => '',
	1 => '任务执行成功率下降，重新计算成功率。',
	2 => '目标消灭确认。',
	//3 => '我觉得我还可以抢救一下……',
	4 => Array(
        '■' => '…………还真的是优秀的个体呢……',
        '月宫 亚由' => '怎……怎么会这样？', 
        '神尾 观铃' => '怎……怎么会这样？', 
        '古河 渚' => '怎……怎么会这样？', 
	),
	5 => Array(
		'冴月 麟' => '【DEAD】',
		'某四面' => ' ♪ Sharing kindness ♪ ',
	),
	6 => '不……不准拿走……快还给我……还给我……',
	7 => Array(
		'电击使 御坂 美琴' => '力尽了……我还……不够强大啊……',
		'班主任 坂持 金发' => '记住吧：如果你憎恨一个人，便要为此付出代价。',
		'花之领主 风见 幽香' => '输掉了啊，不过下次死的就是你了哦！'
	),
	8 => '系统出错了吗？',
	9 => 'Mission in jeopardy, Begin ALT_ROUTINE.',
	10 => '……',
	11 => Array(
        '神鸣阳香' => '我坚信……选择这条道路没……有错……',
        '神鸣此月' => '咳，如果人生能重来的话……我想我一定会重蹈覆辙吧……', 
        '221' => '咳，时代变了么……',
        'Erul Tron' => '咳，时代变了么……',
		'亚玛丽欧·维拉蒂安' => '咳，时代变了么……',
		'便当盒' => '启动ALT+F4紧急脱出程序。',
        '霜火协奏曲' => '咳，时代变了么……', 
        '脸骑士-菜包' => '咳，时代变了么……',
		'东方地雷殿' => '啊。。！放开这个地雷！他还年轻！',		
		'別忘了我' => '做得很好，你又更邁進PVE之路的終點了，加油加油！願我的筆記本可以為你帶來幸運。',
	),
	12 => Array(
		'那回早栗' => '利斯，救救我！',
		'Lugia' => '……',
		'Dark Force' => '请记住，我是由人类的欲望而生的存在，只要人类存在，我也一样会。我们还会再见的，勇敢的人。',
	),
	13 => Array(
		'亚莉丝' => '讨厌！',
		'莱卡' => 'Dangerous Situation...Retreat.',
		'卡玛·克莱因' => '干得不错！在新的世界里再会吧，勇敢的挑战者。'
	),
	14 => Array(
		'投影-零教授' => '（信号中断）',
		'吉祥物 库特' => '我……我还不能死在这里……还有人在等着我……！',
		'风纪委员 静流' => '………………………………！',
		'喧哗少女 叶留佳' => '超級火大！要知道現在小葉子的火氣比海平面還高了啊！',
		'战斗模式 梦美' => '受损超出预期值……放弃武装、脱出。',
		'本气（？） 叶留佳' => '输掉了？这不可能！我的LP难道不是你的80倍么？！',
//		'科学监察 莱卡' => 'Dangerous situation...Escape capsule launched.',
		'守卫者 静流' => '………………………………？！',
	),
	15 => '',
	20 => '這就是善有善報嗎？',
	21 => Array(
	    '虚子' => '你做完后，你的心理得到什么样的满足感，你自己清楚！',
		'水月' => '……',
		'北京推倒你' => '看起来快结束了呢。小心不要一时疏忽领便当了哦。',
	    'BorisX' => 'Boris retreating.',
		'Yoshiko-G' => '什麼？你敢殺我，小心吃我權限啦！',
		'lemon' => 'Mission failed.',
		'Renamon' => '啊！反正我很没存在感嘛……消失了也无所谓的……吧。',
		'beijuzhu' => '北極豬已逃，搬運９課任務完成。',
		'黑色奪魂曲' => 'THE END.',
		'捂脸姬' => '作為ACFUN大逃殺第一批的玩家，肯定是跟不上現代的腳步了啊。',
		'埃尔兰卡' => '直此之前，我为尘埃。即此之后，便作泥土。',
	),	
	22 => Array(
		'冴月麟MK-II' => '一场酣畅淋漓的战斗！脱出！',
		'星莲船四面BOSS' => '我～还～会～再～回～来～的～',
	),
	24 => Array(
		'测试用鱼装自走兵器' => '有些东西，不靠战争是保护不了的！',
	),
	25 => Array(
	    '肥宅' => '你要干什么！不要过来！',
		'春原 阳平' => '呜哇~',
		'真猎人' => '在怪物猎人在索系平台上出新作之前我还不能死啊……',
	    '彩虹独角兽' => '[sob][sob]',
		'海星王' => '没有“他”，我果然还是不行么……',
		'红帽少年' => '现在你就是新的联盟冠军了！',
		'海豹部队' => 'Mission Failed.',
		'萨鲁法尔大王' => '今天，如果我们战死，死在这片战场上，我们虽死犹荣。',
		'Chuck Norris' => 'That’s no glitch.',
	),
	40 => '身为医护人员连自己都救不了，想想都觉得悲催……',
	40 => '早知道就不应聘这种工作了……',
	44 => '怎……怎么会这样？',
	89 => '咕咕……鹌鹑，咕咕咕，大鹌鹑……',
	90 => '我觉得我还可以抢救一下……'
);
$infinfo = Array('b' => '<span class="red">胸</span>', 'h' => '<span class="red">头</span>', 'a' => '<span class="red">腕</span>', 'f' => '<span class="red">足</span>', 'p' => '<span class="purple">毒</span>', 'u' => '<span class="red">烧</span>', 'i' => '<span class="clan">冻</span>', 'e' => '<span class="yellow">麻</span>','w' => '<span class="grey">乱</span>','P'=>'<span class="purple">猛</span>','B'=>'<span class="L5">裂</span>','S'=>'<span class="sienna">石</span>');
$attinfo = Array('N' => '徒手殴打', 'P' => '殴打','K' => '斩刺', 'G' => '射击', 'C' => '投掷', 'D' => '设置引信伏击', 'F' => '释放灵力攻击', 'J' => '狙击');
$skillinfo = Array('N' => 'wp', 'P' => 'wp', 'K' => 'wk', 'G' => 'wg', 'C' => 'wc', 'D' => 'wd', 'F'=> 'wf', 'J'=> 'wg');
//$rangeinfo = Array('N' => 'S', 'P' => 'S', 'K' => 'S', 'G' => 'M', 'C' => 'M', 'D' => 'L', 'F'=> 'M'); #各种攻击方式的射程，移动到combatcfg.php
$restinfo = Array('通常','睡眠','治疗','静养');
$noiseinfo = Array(
	'G' => '枪声',
	'J'=> '枪声',
	'D' => '爆炸声',
	'F'=>'灵气',
	'缩写歌名'=>'这是一个很长很长的歌名，不过至少需要3个字符才能识别！',
	'abs'=>'这就是最短的歌名的一个例子',
	'Crow Song'=>'Crow Song',
	'Alicemagic'=>'Alicemagic',
	'恋歌'=>'恋歌',
	'鸡肉之歌'=>'鸡肉之歌',
	'里海之誓'=>'里海之誓',
	'奇迹再现'=>'奇迹再现',
	);
$exdmgname = Array('p' => '毒性攻击', 'u' => '火焰燃烧', 'i'=>'冻气缠绕', 'd'=>'爆炸','e'=>'电击','w'=>'音波攻击','f' => '<span class="yellow">炽热之焰</span>','k' => '<span class="clan">凝结之息</span>');
$exdmginf = Array('h' => '<span class="red">头部受伤</span>', 'b' => '<span class="red">胸部受伤</span>', 'a'=> '<span class="red">腕部受伤</span>', 'f'=> '<span class="red">足部受伤</span>', 'p'=> '<span class="purple">中毒</span>','P'=> '<span class="purple">中猛毒</span>', 'u'=> '<span class="red">烧伤</span>', 'i'=> '<span class="blue">冻结</span>', 'e'=> '<span class="yellow">身体麻痹</span>', 'w'=> '<span class="grey">混乱</span>','S'=>'<span class="sienna">身体石化</span>');
$infwords = Array('h' => '<span class="red">头部受伤</span>', 'b' => '<span class="red">胸部受伤</span>', 'a'=> '<span class="red">腕部受伤</span>', 'f'=> '<span class="red">足部受伤</span>', 'p'=> '<span class="purple">毒发</span>','P'=> '<span class="purple">猛毒发作</span>', 'B'=> '<span class="red">裂伤发作</span>','u'=> '<span class="red">烧伤发作</span>', 'i'=> '<span class="blue">冻结影响</span>', 'e'=> '<span class="yellow">身体麻痹</span>', 'w'=> '<span class="grey">混乱</span>','S'=>'<span class="sienna">身体石化</span>');
$chatinfo = Array(0 => '全员', 1 => '队伍', 2 => '剧情', 3 => '遗言', 4 => '公告', 5 => '系统');
$npcchat = Array(
	1 => Array(
		'坂持 金发' => Array(
			0 => '“这个世界没有项圈，那只好由我亲手实施惩罚了。”',
			1 => '“现在的年轻人都蔑视成年人，应该煞一煞他们的威风。”',
			2 => '“对蔑视法律的学生就应该先发制人。”',
			3 => '“有两下子，但是你不可能次次都那么走运。”',
			4 => '“大人也有大人的苦衷啊……好好地死去吧。”',
			5 => '“你还很精神嘛，这样的势头很好，继续努力吧。”',
			6 => '“想违抗BR法可不是那么容易的。”',
			7 => '“我好像受了很重的伤呢。”',
			8 => '“我也变成无能的成年人了啊。”',
			9 => '“记住吧：如果你憎恨一个人，便要为此付出代价。”',
			10 => '“这样的情况，暂时撤退吧。”',
			11 => '“距离太远了，暂时撤退吧。”',
			12 => '坂持 金发举枪瞄准：“虽然直接干预实验不怎么合适……”',
			13 => '“记住这个吧，人生是游戏。”',
			'color' => 'evergreen'
		),
		'林无月' => Array(
			0 => '“竟然有能力闯到这里，还以为这次会轻松些呢……看来咱得亲自上阵了。”',
			1 => '“身手不错，不过咱是不会留情的。”',
			2 => '“咱很欣赏你的实力，可不要让咱太失望了。”',
			3 => '“能将咱逼到这个地步……你，有两下子呢。”',
			4 => '“看来咱不能再抱着玩乐的心态了……你，准备好迎接咱的攻击了么？”',
			5 => '“你觉得你的攻击对咱有效果吗？”',
			6 => '“难道你觉得咱会被这样的招式击倒？”',
			7 => '“咱今日真是棋逢对手啊，越来越有意思了呢。”',
			8 => '“咱可没那么容易倒下！”',
			9 => '“呜……这个躯体……咱还是无法自由运用啊……”',
			10 => '“真是的，这个位置的话没法全力反击啊……”',
			11 => '“真是的，竟然在射程之外啊……”',
			12 => '“咱也是生于常磐森林的人啊！”',
			13 => '“你还不懂得运用你的力量，咱为此感到惋惜。”',
			'color' => 'evergreen'
		),
		'红暮' => Array(
			0 => '“红暮转身扛起6个煤气罐： 哦，杀回来了么……不过你也就到此为止了！”',
			1 => '“真可惜，如果不是因为我拿钱做事，我们可能是朋友。”',
			2 => '“好身手，那么轮到我了！”',
			3 => '“对手目标警戒等级提升到『黄』，反击开始。”',
			4 => '“对手目标警戒等级提升到『红』，执行消灭流程。”',
			5 => '“去再训练一百年吧，没准能碰到我。”',
			6 => '“去再训练五十年吧，没准能伤到我。”',
			7 => '“重新判定目标威胁等级中……”',
			8 => '“判定自身伤害程度……任务续行。”',
			9 => '“任务执行成功率下降，重新计算成功率。”',
			10 => '“判定目标在有效射程外，还有点运气啊……”',
			11 => '“判定目标完全在射程外，敢面对面打么？”',
			12 => '“你是不可能让一个没有死的概念的存在感到恐惧的！”',
			13 => '“任务完了。”',
			'color' => 'evergreen'
		)
	),
	5 => Array(
		'冴月 麟' => Array(
			0 => '“【MEET】”',//meet
			1 => '“【ATTACK_FINE】”',//attackfine
			2 => '“【ATTACK_FINE_2】”',
			3 => '“【ATTACK_HURT】”',
			4 => '“【ATTACK_HURT_2】”',
			5 => '“【DEFEND_FINE】”',//defendfine
			6 => '“【DEFEND_FINE_2】”',
			7 => '“【DEFEND_HURT】”',//defendhurt
			8 => '“【DEFEND_HURT_2】”',
			9 => '“【RETREAT】”',//retreat
			10 => '“【NO_COUNTER】”',//can't counterattack
			11 => '“【OUT_OF_RANGE_COUNTER】”',//out of range
			12 => '“【CRITICAL_COUNTER】”',//critical
			13 => '“【DEAD】”',	
			'color' => 'yellow'
		),
		'某四面' => Array(
			0 => '“ ♪ My Little Pony, My Little Pony...Ahh, ahh, ahh, ahhh... ♪ ”',//meet
			1 => '“ ♪ (My Little Pony) ♪ ”',//attackfine
			2 => '“ ♪ I used to wonder what friendship could be ♪ ”',
			3 => '“ ♪ (My Little Pony) ♪ ”',
			4 => '“ ♪ Until you all shared its magic with me ♪ ”',
			5 => '“ ♪ Big adventure ♪ ”',//defendfine
			6 => '“ ♪ Tons of fun ♪ ”',
			7 => '“ ♪ A beautiful heart ♪ ”',//defendhurt
			8 => '“ ♪ Faithful and strong ♪ ”',
			9 => '“ ♪ Sharing kindness ♪ ”',//retreat
			10 => '“ ♪ It\'s an easy feat ♪ ”',//can't counterattack
			11 => '“ ♪ And magic makes it all complete ♪ ”',//out of range
			12 => '“ ♪ You have my little ponies ♪ ”',//critical
			13 => '“ ♪ Do you know you\'re all my very best friends? ♪ ”',	
			'color' => 'yellow'
		)
	),
	6 => Array(
		'Acg_Xilin' => Array(
			0 => '“就凭你也想偷走我重要的东西？我不允许。你去死罢。”',
			1 => '“叽叽咕咕（听不懂的自言自语）”',
			2 => '“为了我的收藏我不会善罢甘休！”',
			3 => '“快看我美丽的收藏品……这样的宝贝，怎么能白送给你！？”',
			4 => '“我跟强盗势不两立！”',
			5 => '“你这样的攻击，没关系么？没关系，没问题。”',
			6 => '“哈哈哈哈，你根本不能让我满足！”',
			7 => '“我诅咒你，妄图打砸抢烧的败类！”',
			8 => '“嘎啊！——（听不懂的嚎叫声）”',
			9 => '“不……不准拿走……快还给我……还给……我……”',
			10 => '“运气真差……运气真差……”',
			11 => '“竟打不到……竟打不到……”',
			12 => 'Acg_Xilin露出了古怪的笑容：“尝尝我的奥义吧，这可是我精心收藏的魔法哟！”',
			13 => '“忘记历史就意味着背叛，背叛就意味着……死亡。”',
			'color' => 'yellow'
		)
	),
	7 => Array(
		'电击使 御坂 美琴' => Array(
			0 => '“擅自侵入禁区的你，应该对自己的下场有所觉悟了吧？”',
			1 => '“只要杀死了你，净化网络的计划就离成功更近一步了吧！”',
			2 => '“知道电磁炮吗？接下这一招，然后死去吧！”',
			3 => '“你的能力竟然这么强吗……看来我必须使出全力了！”',
			4 => '“你这样的随意践踏别人的梦想的人……最差劲了！”',
			5 => '“我可是LEVEL 5的超能力者！普通人的攻击怎么会对我起作用？”',
			6 => '“我还以为入侵禁区的会是什么样的强者……竟然只有你这点实力吗？”',
			7 => '“我才不会因为这样的攻击而倒下！”',
			8 => '“我也有我的立场啊！”',
			9 => '“力尽了……我还……不够强大啊……”',
			10 => '“没预料到这种情况……”',
			11 => '“电磁炮50米的射程竟然不够……”',
			12 => '御坂 美琴周身被蓝色电光层层笼罩：“别以为我的能力只能击飞硬币！”',
			13 => '“所以说，你这样的人最差劲了。”',
			'color' => 'clan'
		),
		'班主任 坂持 金发' => Array(
			0 => '“这个世界没有项圈，那只好由老师我亲手实施惩罚了。”',
			1 => '“现在的年轻人都蔑视成年人，应该煞一煞他们的威风。”',
			2 => '“对蔑视法律的学生就应该先发制人。”',
			3 => '“有两下子，但是你不可能次次都那么走运。”',
			4 => '“老师也有老师的苦衷啊……好好地死去吧。”',
			5 => '“你还很精神嘛，这样的势头很好，继续努力吧。”',
			6 => '“想违抗BR法可不是那么容易的。”',
			7 => '“我好像受了很重的伤呢。”',
			8 => '“我也变成无能的成年人了啊。”',
			9 => '“记住吧：如果你憎恨一个人，便要为此付出代价。”',
			10 => '“这样的情况，暂时撤退吧。”',
			11 => '“距离太远了，暂时撤退吧。”',
			12 => '坂持 金发举枪瞄准：“虽然老师干预游戏是违反规则的……”',
			13 => '“记住这个吧，人生是游戏。”',
			'color' => 'yellow'
		),
		'花之领主 风见 幽香' => Array(
			0 => '“于是，还真有胆敢闯进禁区的人啊，我就奉陪到底吧。”',
			1 => '“把妖力当做伪科学而轻视那就太可笑了。”',
			2 => '“我与你之间究竟谁最强呢，就来分个胜负吧。”',
			3 => '“可不要以为我的能力只是让花朵开放那种程度的哦？”',
			4 => '“竟然能逼我使出全力，真是愉快的战斗啊。”',
			5 => '“这种程度的力量，还不够跟我过招呢。”',
			6 => '“这样的伤痛对于妖怪来说根本不算什么呢。”',
			7 => '“杂草大概是最适合你的植物吧？”',
			8 => '“轮到我反击了呢，我会把你的攻击加倍还给你的哦？”',
			9 => '“输掉了啊，不过下次死的就是你了哦！”',
			10 => '“不妙啊，轻敌了，总之先撤退吧。”',
			11 => '“弹幕射程不够啊，总之先撤退吧。”',
			12 => '风见 幽香张开阳伞做出了一个潇洒的转身：“也许你还没见识过魔炮的力量吧？”',
			13 => '“我还没满足呢，可别就这样轻易地死掉了哦。”',
			'color' => 'lime'
		)
	),
	9 => Array(
	'蓝凝' => Array(
			0 => '“TARGET DETECTED，Commencing FIRST STRIKE。”',
			1 => '“TARGET CONFIRMED，MISSION START。”',
			2 => '“Set, ATTACK STANCE。”',
			3 => '“OPPONENT LEVEL C VERIFIED, begin COUNTER ATTACK。”',
			4 => '“OPPONENT LEVEL B VERIFIED, begin RUNE RELEASE。”',
			5 => '“……too slow。”',
			6 => '“……too weak。”',
			7 => '“……RELOADING RUNES。”',
			8 => '“Set，COUNTER STANCE。”',
			9 => '“Mission in jeopardy, Begin ALT_ROUTINE。”',
			10 => '“……Switching target。”',
			11 => '“……target OUT OF RANGE。”',
			12 => '“……………………………………”',
			13 => '“No Remorse。”',
			'color' => 'clan'
		)
	),
	10 => Array(
		
	),
	11 => Array(
		'神鸣阳香' => Array(
			0 => '“发现目标。”',//meet
			1 => '“你什么都不需要做，站着被我的子弹开窟窿就好。”',//attackfine
			2 => '“你会感到荣幸的……你有机会因为仪式而成为黄金猎犬的枪下亡魂。”',
			3 => '“不得不认真起来了。”',
			4 => '“为了仪式，请你给我去死吧。”',
			5 => '“这种程度不痛不痒。”',//defendfine
			6 => '“这也算得上是战斗吗？”',
			7 => '“这伤痛，让我回想起那一天了。”',//defendhurt
			8 => '“干得好……黄金猎犬会加倍奉还的！”',
			9 => '“我坚信……选择这条道路没……有错……”',//retreat
			10 => '一言不发地撤离了。',//can't counterattack
			11 => '“即使是神器黄金猎犬，射程依然微妙的不足啊。”',//out of range
			12 => '“来接下黄金猎犬的致命射击！”',//critical
			13 => '“血祭之仪……再度进展。”',	
			'color' => 'yellow'
		),
		'神鸣此月' => Array(
			0 => '“又看到一个可怜的祭品，真不想这么说，可是……”',//meet
			1 => '“来让我试下刀够不够锋利吧！”',//attackfine
			2 => '“让你见识一下跟姐姐的枪成对的太刀月下美人！”',
			3 => '“果然对无冤无仇的人也只能痛下杀手了……”',
			4 => '“为了姐姐……只能努力了……”',
			5 => '“喂喂，这连切磋都算不上呀。”',//defendfine
			6 => '“是不是太没趣了点呢……”',
			7 => '“不可以再这样下去了……”',//defendhurt
			8 => '“不反击不行了！可是……杀红了眼的话我也许就控制不住自己了。”',
			9 => '“咳，如果人生能重来的话……我想我一定会重蹈覆辙吧……”',//retreat
			10 => '“不妙……先撤吧。”',//can't counterattack
			11 => '“唔！这个距离即使是月下美人都够不着……”',//out of range
			12 => '神鸣此月宛如疾风般的刀刃已经到了眼前：“有破绽！”',//critical
			13 => '“既然阻止不了姐姐……那么就让我来分担姐姐的罪业吧……”',	
			'color' => 'yellow'
		)
	),
	12 => Array(
		'Dark Force幼体' => Array(
			0 => '“这么快就过来了么？！”',
			1 => '“……？”',
			2 => '“……！”',
			3 => '“……让开。”',
			4 => '“……”',
			5 => '“唔嗯……”',
			6 => '“…………”',
			7 => '“…………！！”',
			8 => '“回避……！”',
			9 => '“我………！”',
			10 => '“预测失败！？”',
			11 => '“……看我不舒服么？”',
			12 => '“……能成功吧……？”',
			13 => '“虽然情感上很对不起，但这是必要的牺牲。”',
			'color' => 'linen'
		),
		'Dark Force' => Array(
			0 => '“你所作的一切都要被偿还。”',
			1 => '“欲望带来破灭。”',
			2 => '“无视你的欲望就不会死你难道还不明白？！”',
			3 => '“开始反击。”',
			4 => '“让你看看我真正的力量！”',
			5 => '“这就是人类的力量么？”',
			6 => '“干的不错啊你。”',
			7 => '“让我看看你的能力吧！”',
			8 => '“无论是这个时空还是另外一个，人类都是一样的生物。”',
			9 => '“请记住，我是由人类的欲望而生的存在，只要人类存在，我也一样会。<br>我们还会再见的，勇敢的人。”',
			10 => '“你打过来了么？”',
			11 => '“武器的射程，还不够吗？”',
			12 => '“……这样设定的话，应该能成功吧……？”',
			13 => '“反对巴特利安的力量都要被毁灭。”',
			'color' => 'linen'
		),
		'' => Array(
			0 => '',//meet
			1 => '',//attackfine
			2 => '',
			3 => '',//attackhurt
			4 => '',
			5 => '',//defendfine
			6 => '',
			7 => '',//defendhurt
			8 => '',
			9 => '',//战死
			10 => '',//无法反击
			11 => '',//超出攻击距离
			12 => '',//critical
			13 => '',//杀死对手
			'color' => 'linen'
		),
		'那回早栗' => Array(
			0 => '',//meet
			1 => '',//attackfine
			2 => '',
			3 => '',//attackhurt
			4 => '',
			5 => '',//defendfine
			6 => '',
			7 => '',//defendhurt
			8 => '',
			9 => '“利斯，救救我！”',//战死
			10 => '',//无法反击
			11 => '',//超出攻击距离
			12 => '',//critical
			13 => '“好可怕……呜……好可怕……”',//杀死对手
			'color' => 'linen'
		),
		'flyair234' => Array(
			0 => '',//meet
			1 => '',//attackfine
			2 => '',
			3 => '',//attackhurt
			4 => '',
			5 => '',//defendfine
			6 => '',
			7 => '',//defendhurt
			8 => '',
			9 => '“明明……还能再来一发……”',//战死
			10 => '',//无法反击
			11 => '',//超出攻击距离
			12 => '',//critical
			13 => '“你的太小啦！”',//杀死对手
			'color' => 'linen'
		),
		'sandeflee' => Array(
			0 => '',//meet
			1 => '',//attackfine
			2 => '',
			3 => '',//attackhurt
			4 => '',
			5 => '',//defendfine
			6 => '',
			7 => '',//defendhurt
			8 => '',
			9 => '“手机坏了修修修！！！”',//战死
			10 => '',//无法反击
			11 => '',//超出攻击距离
			12 => '',//critical
			13 => '',//杀死对手
			'color' => 'linen'
		),
		'deadhunk' => Array(
			0 => '',//meet
			1 => '',//attackfine
			2 => '',
			3 => '',//attackhurt
			4 => '',
			5 => '',//defendfine
			6 => '',
			7 => '',//defendhurt
			8 => '',
			9 => '“大清亡了？不可能！”',//战死
			10 => '',//无法反击
			11 => '',//超出攻击距离
			12 => '',//critical
			13 => '“对不起，我杀错人了”',//杀死对手
			'color' => 'linen'
		),
		'竹箭' => Array(
			0 => '',//meet
			1 => '',//attackfine
			2 => '',
			3 => '',//attackhurt
			4 => '',
			5 => '',//defendfine
			6 => '',
			7 => '',//defendhurt
			8 => '',
			9 => '“我这里有糖哦，要吃吗？诶，怎么死了……”',//战死
			10 => '',//无法反击
			11 => '',//超出攻击距离
			12 => '',//critical
			13 => '“我这里有糖哦，要吃吗？诶，怎么死了……”',//杀死对手
			'color' => 'linen'
		),
		'瓦顿巴' => Array(
			0 => '',//meet
			1 => '',//attackfine
			2 => '',
			3 => '',//attackhurt
			4 => '',
			5 => '',//defendfine
			6 => '',
			7 => '',//defendhurt
			8 => '',
			9 => '“我真的没有在课上吃便当！”',//战死
			10 => '',//无法反击
			11 => '',//超出攻击距离
			12 => '',//critical
			13 => '',//杀死对手
			'color' => 'linen'
		),
		'狂信者' => Array(
			0 => '',//meet
			1 => '',//attackfine
			2 => '',
			3 => '',//attackhurt
			4 => '',
			5 => '',//defendfine
			6 => '',
			7 => '',//defendhurt
			8 => '',
			9 => '“……！”（把长枪捅进了自己的身体）',//战死
			10 => '',//无法反击
			11 => '',//超出攻击距离
			12 => '',//critical
			13 => '“……！”（用喜悦的眼神盯着虚空）',//杀死对手
			'color' => 'linen'
		),
		'二重弑'=>Array(
			0=>'“嗯……？新的倒霉鬼出现了了吗？”',
			1=>'“姑且还是离我远点比较好…”',
			2=>'“都说了离我远点啊……”',
			3=>'“快走吧……”',
			4=>'“快走吧……”',
			5=>'“赶紧离开这里。”',
			6=>'“赶紧离开这里。”',
			7=>'“还有时间，所以快离开我。”',
			8=>'“还有时间，所以快离开我。”',
			9=>'“时间到了……”',
			10=>'“啧……”',
			11=>'“虽然是正确的选择…”',
			12=>'“离开这里”',
			13=>'“我已经说过要你离开了…”',
			'color'=>'linen'
		),
		'斩断者-二重弑'=>Array(
			0=>'“那么，姑且开始进行测试（捧读）…………测你妹啊赶紧躺了！”',
			1=>'“吔O啦！”',
			2=>'“吔O啦你！”',
			3=>'“炎切…！”',
			4=>'“…炎重！”',
			5=>'“滚回去重练！”',
			6=>'“砍掉重练！”',
			7=>'“梦话等你躺了睡着的时候再说。”',
			8=>'“梦话等你躺了睡着的时候再说。”',
			9=>'“去找亚O丝啦你这鶸！”',
			10=>'“贫弱！”',
			11=>'“怂货！”',
			12=>'斩断者-二重弑突然在你眼前消失，背后传来她的声音“……霞楼！”',
			13=>'“嗨尼玛O滚去睡！”',
			'color'=>'linen'
		),
		'魑魅' =>  Array(
			0 => '“汝可愿成为吾之眷属”',
			1 => '“用膳时间到了”',
			2 => '“新鲜的血液”',
			3 => '“血...给我血液”',
			4 => '“错的不是我而是世界”',
			5 => '“你真的能打到我么”',
			6 => '“痛...”',
			7 => '“我要杀了你”',
			8 => '“吾乃神罚”',
			9 => '“执念不灭，我就永不死亡”',
			10 => '“你给我等着”',
			11 => '“看我不杀看你”',
			12 => '“爆碎牙追杀”',
			13 => '“再见 还有对不起”',
			'color' => 'linen'
		),
		/*
		'无姓之人' => Array(
			0 => '戴着奇怪面具的人用粗哑的嗓音开口了：“我不想杀人的，真的不想。”',
			1 => '“死，或生。”',
			2 => '“你死，或是我生”',
			3 => '“到底是谁死到临头了呢。”',
			4 => '“时辰到了。”',
			5 => '“啊，真疼。”',
			6 => '“衣服，又破洞了。”',
			7 => '“我死到临头了吗？”',
			8 => '“加倍奉还。”',
			9 => '“又死了一个人。”',
			10 => '“大难不死，未必有福。”',
			11 => '“阎王要命，谁敢不给。”',
			12 => '“到时候了。”',
			13 => '“又死了一个人”',
			'color' => 'linen'
		),
		*/
		'克隆型无名-拾荒军火商' => Array(
			0 => '“哟，要买点什么嘛？我这有不少军火哦。”',
			1 => '“士兵来了？！”',
			2 => '“谁！”',
			3 => '“干，干掉了嘛？”',
			4 => '“就算杀死了也没问题吧？”',
			5 => '“我一定会十倍奉还！”',
			6 => '“我可跑得比谁都快！”',
			7 => '“等会！我能反杀！”',
			8 => '“我，会输？”',
			9 => '“老大...救命...”',
			10 => '“诶诶我的枪掉了！”',
			11 => '“我会回来并且十倍奉还。”',
			12 => '“你的生命，已如风中残烛。”',
			13 => '“おまえは、もう死んでいる。”',
			'color' => 'linen'
		),
		'saki' => Array(
			0 => 'saki转过身来，缓缓地说：“你也是来妨碍我完成贤者之石的吗?”',
			1 => '“不要来妨碍我！”',
			2 => '“不要来妨碍我！”',
			3 => '“唔。。。没想到你还挺难缠的。”',
			4 => '“唔。。。没想到你还挺难缠的。”',
			5 => '“切，不自量力。”',
			6 => '“切，不自量力。”',
			7 => '“切，不自量力。”',
			8 => '“切，不自量力。”',
			9 => '“功亏一篑啊。”',
			10 => '“啧，有两下子。”',
			11 => '“切，跑得还快。”',
			12 => '“让你看看我的威力。”',
			13 => 'saki摇了摇头，看着倒在血泊里的你说：“还是菜 别说了 就是菜。”',
			'color' => 'linen'
		),
		'卖萌少女 团圆久子' => Array(
			0 => '“我还能说些什么呢～”',
			1 => '“吔窝无限手刀啦！”',
			2 => '“吔窝无限手刀啦！”',
			3 => '“坏人 接招！”',
			4 => '“坏人 接招！”',
			5 => '“呜。。。”',
			6 => '“呜。。。”',
			7 => '“坏人坏人坏人！”',
			8 => '“坏人坏人坏人！”',
			9 => '“窝这么萌你也打！生气生气生气！”',
			10 => '“占着距离优势的都是坏人！”',
			11 => '“占着距离优势的都是坏人！”',
			12 => '“尝尝窝的厉害！”',
			13 => '“不不 我不是针对你。我是说在场各位 都是垃圾”',
			'color' => 'linen'//这个别改
		),
		'腹黑少女 团圆久子' => Array(
			0 => '“窝超级火大的哎！快来让窝打一打”',
			1 => '“变态接招！”',
			2 => '“变态接招！”',
			3 => '“看窝珍藏的抱枕的厉害！”',
			4 => '“看窝珍藏的抱枕的厉害！”',
			5 => '“痛痛痛QAQ”',
			6 => '“痛痛痛QAQ”',
			7 => '“诶 窝快要输掉了么”',
			8 => '“诶 窝快要输掉了么”',
			9 => '“你们这群只会偷袭姿态一发打死窝的家伙 哼”',
			10 => '“偷袭么。。有本事来正面打窝啊！”',
			11 => '呜。。这样居然还会被占距离优势QAQ',
			12 => '一♀发入魂～',
			13 => '“不不 我不是针对你。我是说在场各位 都是垃圾”',
			'color' => 'linen'//这个别改
		),
		'大黑' => Array(
			0 => '“您好，我是来自深海的提督，大黑。”',
			1 => '“你对我们的驱逐舰，有意见么？”',
			2 => '“你对我们的人形兵器，有意见么？”',
			3 => '“蛮不错的嘛，你要是打赢了，我就把武器送给你。”',
			4 => '“你的水准只有这种程度么？！”',
			5 => '“一时大意...我说，要不咱们坐下来喝杯茶再继续吧。”',
			6 => '“看你一表人才，要不要来深海当提督？”',
			7 => '“不要着急，等我喝完这杯茶再说。”',
			8 => '“我看你是不见铁底不掉泪”',
			9 => '“我出门前一定是拿错武器了.....”',
			10 => '“啊，我还在填装，你能站在原地等我一会么？”',
			11 => '“射程以外？难道我出门前拿错配件了么....”',
			12 => '“生死破绽一瞬间，接下来就看看你自己的造化了。”',
			13 => '“看来你不懂得生命的宝贵。”',
			'color' => 'linen'//这个别改
		),
		'一个路痴' => Array(
			0 => '“唔...这里是哪儿啊...”',
			1 => '“再靠近可就要打你了。”',
			2 => '“不管是谁了，看招！”',
			3 => '“让我出去！不然就打你！”',
			4 => '“是不是你放的地雷？”',
			5 => '“别打我啊...”',
			6 => '“诶呀诶呀。”',
			7 => '“要不是之前太倒霉的话...”',
			8 => '“再打我我就要认真了！”',
			9 => '“都喜欢用拳头说话吗，那我也要认真了！”',
			10 => '“打不到你，那就算了。”',
			11 => '“离那么远啊...”',
			12 => '“啊咧，出手重了...”',
			13 => '“那个...对不起啊...”',
			'color' => 'linen'
		),
		'风一般的路痴' => Array(
			0 => '找不到路的话，就打一条出去！',
			1 => '路痴突然出现在你面前，接着把荆棘雷按到了你的脸上，然后对你说：“你告诉我，荆棘骑脸怎么输？”',
			2 => '“呵，脸接荆棘的感觉怎么样？”',
			3 => '“我最讨厌乱放地雷的人。”',
			4 => '“去死吧！”',
			5 => '“只是这样还打不倒我。”',
			6 => '“你还不是我的对手。”',
			7 => '“有点实力啊，不过还没结束！”',
			8 => '“接下来才是关键！”',
			9 => '“这里到底是哪啊...”',
			10 => '“...要拉近距离...”',
			11 => '“...再靠近一点...”',
			12 => '“你能接下这一击吗？”',
			13 => '“再见了。”',
			'color' => 'linen'
		),
	),
	13 => Array(
		'欢庆型亚莉丝' => Array(
			0 => '“宾客☆发现～”',//meet
			1 => '“礼炮！BIU！”',//attackfine
			2 => '“礼炮准备就绪！”',
			3 => '“礼炮！BIU！”',//attackhurt
			4 => '“礼炮准备就绪！”',
			5 => '“待会也让你试试礼炮的说！”',//defendfine
			6 => '“待会也让你试试礼炮的说！”',
			7 => '“啊呜……待会也让你试试礼炮的说！”',//defendhurt
			8 => '“啊呜……待会也让你试试礼炮的说！”',
			9 => '“人家还没玩够呢”（抽泣）',//战死
			10 => '（手忙脚乱中）',//无法反击
			11 => '“呜，这超出礼炮说明书写的距离啦！”',//超出攻击距离
			12 => '“大☆开☆花！”',//critical
			13 => '“哎呀哎呀～倒下了诶～”',//杀死对手
			'color' => 'linen'
		),
	),
	21 => Array(
		'虚子' => Array(
			0 => '“没人理我了吗？我被无视了吗？”',//meet
			1 => '“原谅我杀人！但是不杀的话,我就不是人了! ”',//attackfine
			2 => '“你们根本就搞不清楚状况！打法根本就是错的！”',
			3 => '“既想说自己是沙包，又在做不是沙包该做的事！这样的事实，又一次说明这些神触们的无药可救！”',
			4 => '“你还能有正常人的意识吗？明知前面是悬崖也要跳！无知！无聊！”',
			5 => '“哈哈！玩家！你牛！但我更牛!  ”',//defendfine
			6 => '“你不懂的话，就不是中国人！”',
			7 => '“这样的伤害还有存在的意义！”',//defendhurt
			8 => '“你们啊！能清醒点儿吗？”',
			9 => '“你做完后，你的心理得到什么样的满足感，你自己清楚！”',//retreat
			10 => '“哎！现在就算听《蜀绣》，我的心情也好不起来！”',//can't counterattack
			11 => '“留下可怜的我独自哀伤，有人同情却无人理解！哎！”',//out of range
			12 => '“水月这个id，老是拿什么必杀技说事，其实是什么都搞不清楚，还一直说！”',//critical
			13 => '“已经被打死了！大快人心啊！”',
			'color' => 'linen'
		),
		'水月' => Array(
		    0 => '“Love your neighbor as yourself.”',//meet
			1 => '“作恶的，必被剪除!”',//attackfine
			2 => '“愚昧人若静默不言，也可算为智慧。闭口不说，也可算为聪明。”',
			3 => '“……”',
			4 => '“……”',
			5 => '“宽恕人的过失，便是自己的荣耀！”',//defendfine
			6 => '“……北斗要讲毛笑话……”',
			7 => '“……唔”',//defendhurt
			8 => '“……”',
			9 => '“……”',//retreat
			10 => '“……”',//can't counterattack
			11 => '“……Avoid godless chatter……”',//out of range
			12 => '“野驴有草岂能叫唤，牛有料，岂能吼叫？！”',//critical
			13 => '“……JOB 38:11”',		
			'color' => 'clan'
		),
		'北京推倒你' => Array(
		    0 => '“虽然我自称是<span class="blue">历史的眼泪</span>。但很可惜，历史这东西是不相信眼泪的。”',//meet
			1 => '“所谓<span class="red">铁拳无敌</span>，那么就一定是用拳头来证明一切的。”',//attackfine
			2 => '“力道不错，那么该我的反击了！”',
			3 => '“不错啊，也许我也应该重新审视审视你了。”',
			4 => '“很久没有遇到过你这种强力的人物了。”',
			5 => '“离开这里吧，这里不是你这种弱者应该呆的地方。”',//defendfine
			6 => '“离开这里吧，你这种弱者只有再去进行训练才能伤害到我啊。”',
			7 => '“很强，很强啊！”',//defendhurt
			8 => '“唔.....看起来身体有些力不从心了呢。”',
			9 => '“看起来快结束了呢。小心不要一时疏忽领便当了哦。”',//retreat
			10 => '“闪避能力很高啊，但是下一招你还能闪过去吗？”',//can't counterattack
			11 => '“用远程武器打游击战术啊！那么小心，不要让我捕捉到你的身影哦。”',//out of range
			12 => '<span class="white">不知从何而来的数据附着在面前那人的拳头上，使其发出了异样的光芒</span>，“如果说之前都是小意思的话，那么就尝试接下这招吧！”',//critical
			13 => '“弱者，就应该去弱者应该呆的地方。”',
			'color' => 'clan'
		),
		'BorisX' => Array(
		    0 => '“It is I, Boris!”',//meet
			1 => '“There is nothing I cannot do!”',//attackfine
			2 => '“This will be easy.”',
			3 => '“Damn traitorous dogs!”',//attackhurt
			4 => '“Eat lead!”',
			5 => '“Fools, you cannot touch me!”',//defendfine
			6 => '“Do not mess with me.”',
			7 => '“We must have reinforcements!”',//defendhurt
			8 => '“It is very bad here, comrade!”',
			9 => '“Boris retreating.”',//retreat
			10 => '“Good luck, comrade.”',//can't counterattack
			11 => '“I am not going out there!”',//out of range
			12 => '天空中突然出现几架米格战机！“Bring on the MIGs!”',//critical
			13 => '“Who is next?”',//kill
			'color' => 'red'
		),
		'Renamon' => Array(
		    0 => '“咦？我为什么在这里呢？”',//meet
			1 => '“虽然不知道为什么可是我会努力打败你的！”',//attackfine
			2 => '“不知道！不知道！我真的不知道为什么可是身体不由自主地动起来了！”',
			3 => '“我的画笔可是有毒的画笔！”',
			4 => '“说真的我真不知道我在干什么呢……”',
			5 => '“不要以为这样子就能让我趴下，我的墨水还是有很多的！”',//defendfine
			6 => '“真希望战斗很快就会结束啊……不过留下来的一定是我。”',
			7 => '“快点！在我还没有发……发……唔飙……之前赶紧逃吧！”',//defendhurt
			8 => '“我还有力气来着……只要再坚持一下……”',
			9 => '“啊！反正我很没存在感嘛……消失了也无所谓的……吧。”',//retreat
			10 => '“稍微一点小失误……抱歉咯。”',//can't counterattack
			11 => '“这个一点都不好！”',//out of range
			12 => '“不！要！强！调！为！什！么！是（ping）（ru）啦！！和（pin）（ru）完全没有关系！”',//critical
			13 => '“看来存在感能＋1了呢……”',
			'color' => 'yellow'
		),
		'beijuzhu' => Array(
			0 => '“我也是ACFUN大逃殺第一批的玩家，和捂臉姬一樣都是搬運９課的成員之一，人稱「北極豬」。”',
			1 => '“如果你是沒有做好準備就來挑戰，那樣的話我應該可以把你的屍體搬離英靈殿吧。”',
			2 => '“喔？就算你身手很敏捷，也比不上強襲姿態的突襲率吧？”',
			3 => '“只要還沒有死，就有希望。”',
			4 => '“稍微等一下，在我死之前...”',
			5 => '“反擊姿態預備！開始！”',
			6 => '“不准逃！”',
			7 => '“這是真的被打成豬了啊。”',
			8 => '“只要HP不是0，反擊就是有理。”',
			9 => '“北極豬已逃，搬運９課任務完成。”',
			10 => '“竟然如此剛好反擊不能。”',
			11 => '“目標太遠了，打不到人啊。”',
			12 => '“你在地圖上看見的「變磚PSP」，效果只是杏仁豆腐版本，有本事就試試看這個PSP吧！”',
			13 => '“武神當中我最沒存在感了，那這回又如何呢？”',
			'color' => 'yellow'
		),
		'黑色奪魂曲' => Array(
			0 => '“你好，我是黑曲，是台灣人，與冴冴共同創作大逃殺劇情，像是「紅暮」「藍凝」。”',
			1 => '“曾經呢，超９武神霸斬是我用來打天下的靈系武器，但是現在的效果完全是「曾經的榮光」了。”',
			2 => '“恩？你問為什麼我的武器這回不是靈系？那種小細節不用太在意。”',
			3 => '“雖然說我以前有很多作品，但是現在我畫的東西最後都揉掉了，因為水平落差太大了啊。”',
			4 => '“這種情況，我大概快封筆了也說不定。”',
			5 => '“而遊戲中以我為命名的防具也是，在這時代也變成「曾經的榮光」了。”',
			6 => '“黑曲在英靈殿的定位...是類似以前真職人「東方地雷殿」吧，吉祥物般的存在。”',
			7 => '“我快要死了嗎...”',
			8 => '“現在這情況，可怕啊。”',
			9 => '“THE END.”',
			10 => '“和我現在的情況一樣，作畫時力不從心了啊。”',
			11 => '“武器射程太近了，但是靈系即使是已經被削的現在，依然不會弱。”',
			12 => '“奧義，超！９！武！神！霸！斬！！！”',
			13 => '“對不起，出手太重了。喂！你快醒醒啊！不會就這樣...死了吧？”',
			'color' => 'yellow'
		),
		'捂脸姬' => Array(
		    0 => '“大家好，我是ACFUN大逃殺第一批的玩家，真要說有什麼職位的話，那就是「試玩」。”',//meet
			1 => '“放心，身為最弱武神組的我，有足夠防禦是絕對可以擋下的。”',//attackfine
			2 => '“我竟然先攻了第二次？有一就有二，無三不成禮嗎？”',
			3 => '“被打成這樣肯定是要送武神之魂的節奏吧？”',
			4 => '“我真心不知道我怎麼可能在玩家有很高的先手率，即使我是偷襲姿態。”',
			5 => '“你是不可能看到這句台詞的，你一定是耍老千！”',
			6 => '“你是不可能看到這句台詞的，你一定是耍老千！”',
			7 => '“你是不可能看到這句台詞的，你一定是耍老千！”',
			8 => '“你是不可能看到這句台詞的，你一定是耍老千！”',
			9 => '“作為ACFUN大逃殺第一批的玩家，肯定是跟不上現代的腳步了啊。”',//retreat
			10 => '“你是不可能看到這句台詞的，你一定是耍老千！”',//can't counterattack
			11 => '“就因為是爆系又不是強襲姿態才會被一個叫「計劃通行」的ID給偷到武神之魂了啊！！”',//out of range
			12 => '“既然你讓我先攻了，那就試試看爆系這70%的最高命中率吧！”',//critical
			13 => '“最弱武神組的我，竟然能殺死人了？你弱爆了。”',
			'color' => 'yellow'
		),		
		'Yoshiko-G' => Array(
            0 => '“賭玉？輸了會有什麼後果嗎？”',//meet
            1 => '“闖英靈殿的你，明知有危險也要來嗎？不作死就不會死，為什麼你就是不明白？”',//attackfine
            2 => '“可別說強襲姿態是流氓，既然認為流氓還要闖英靈殿，這是何等的矛盾！”',
            3 => '“四面寫的切糕系統什麼的最惡毒了，最終導致切糕通貨膨脹以及刷切糕各種情況發生。”',//attackhurt
            4 => '“四面那個偷懶不幹活，成天只會打飛機的程序員，必被減除。”',
            5 => '“傷害制御是很好的，只要武神還留在場上，你的風險就會居高不下！”',//defendfine
            6 => '“攻擊就是最好的防禦，你以為這樣子就能讓我躺下？你也太天真了！”',
            7 => '“你現在認輸還來得及，回頭是岸啊！不然我很肯定你一定會死於各種奇蹟原因。”',//defendhurt
            8 => '“只要我還有HP，我就是要讓看著你玩脫才過癮。”',
            9 => '“什麼？你敢殺我，小心吃我權限啦！”',//retreat
            10 => '“哼！你以為不能反擊是你運氣好？”',//can't counterattack
            11 => '“只敢用爆系的你，與其說是小心，不如說是膽小。”',//out of range
            12 => '「守序善良」？那個會想辦法討好玩家的四面已經死了，讓你看看什麼才是「混亂邪惡」！”',//critical
            13 => '“賭玉的後果，就是被人卸了一條腿，但是我可是有幾萬條腿呢，哈哈哈！”',//kill
            'color' => 'yellow'
		),
		'lemon' => Array(
		    0 => '“ACDTS Bot beta #1. Moving out.”',//meet
			1 => '“Enemy spotted.”',//attackfine
			2 => '“Engaging.”',
			3 => '“Engaging. Taking casualties.”',
			4 => '“Engaging. Need support.”',
			5 => '“Enemy encountered. Counterattack.”',//defendfine
			6 => '“In cover behind sandbags. Counterattacking.”',
			7 => '“Taking fire. Need assistance.”',//defendhurt
			8 => '“Need backup.”',
			9 => '“Mission failed.”',//retreat
			10 => '“Enemy is in cover. Supressing fire, need assistance.”',//can't counterattack
			11 => '“Enemy out of range.”',//out of range
			12 => '“For the further!”',//critical
			13 => '“Enemy down.”',
			'color' => 'clan'
		),
		'埃尔兰卡' => Array(
			0 => '“在此之前的一切，大概都在你的流程之内。但接下来的战斗，却在规则之外。”',//meet
			1 => '“命运会阻挠你，欺辱你，将你高高抛起再狠狠落下，命运可以轻视你，但你却无法不直面它。”',//attackfine
			2 => '“运气固然重要，但过度依赖运气是很危险的。”',
			3 => '“看来你坚持得也很困难啊……实在难过的话，有时候放弃也是一种选择。”',
			4 => '“看来是你的机会，请继续努力吧。”',
			5 => '“你好像已经接近胜利了，但似乎又很遥远，你又是怎么觉得的呢？”',//defendfine
			6 => '“对于施法者来说，这是一件再平常不过的事了。”',
			7 => '“你似乎很高兴啊，希望你能将这份雀跃一直保持下去。”',//defendhurt
			8 => '“不知道这时的你是不是依然感到兴奋呢……”',
			9 => '“直此之前，我为尘埃。即此之后，便作泥土。”',//retreat
			10 => '“我是该称赞你吗……”',//can't counterattack
			11 => '“干得很好嘛，说明你开始使用头脑去战斗了。”',//out of range
			12 => '“那么……接下来……”',//critical
			13 => '“我喜欢你努力的样子，但很多事光靠努力是做不到的，我也对此表示遗憾。”',
			'color' => 'deeppink'
		),
	),
	22 => Array(
		'冴月麟MK-II' => Array(
			0 => '“决战英灵殿！令人燃烧殆尽的战斗就要开始了！”',
			1 => '“这个世界早已今非昔比，你的战术能跟上时代的步伐吗？”',
			2 => '“探索和战斗的背后含义是什么，你有没有思考过？”',
			3 => '“NPC的血量是玩家的成千上万倍，但是为什么依然倒在玩家剑下？”',
			4 => '“在不久的将来也许咱还会主动出击！”',
			5 => '“呵哈哈，不够，还不够！没有做到一击毙命会增大你的风险！”',
			6 => '“给咱留下LP就意味着翻盘的可能性，简而言之就是夜长梦多！”',
			7 => '“即使高级NPC已处于生命危险，也不意味着你下一次攻击就能得逞！”',
			8 => '“既然你已经走到这里，想必你一定在思考跨过我的尸体之后应该做些什么了！”',
			9 => '“一场酣畅淋漓的战斗！脱出！”',
			10 => '“无法反击的状态，这是指咱暂时处于不利反击的位置。”',
			11 => '“射程不足，因为你正使用射程大于等于投系的武器。”',
			12 => '三色的光芒从冴月麟的全身喷涌而出：“魂！常磐之力！Unlimited Code Works！”',
			13 => '“那么，咱为又一次坑了你道歉。”',
			'color' => 'yellow'
		),
		'星莲船四面BOSS' => Array(
			0 => '“那么，真名解放！下面就是见证奇迹的时刻！”',
			1 => '“既然我占尽先机，你接下来就无法反击！”',
			2 => '“爆炸属性虽然给力，有防爆属性就可以硬扛了。”',
			3 => '“我的内定称号是‘天赋异秉’，作为NPC大约能把伤害提升到无称号的3倍！”',
			4 => '“而冴冴的内定称号是‘换装迷宫’，一定概率可以切换武器，令人防不胜防。”',
			5 => '“主伤害和附加伤害……嗯也许已经到了再次改革的前夜了。”',
			6 => '“幸好NPC还不会踩雷，否则你们一定会让英灵殿铺满大打击。”',
			7 => '“继续攻击的话，也许你的RP会下降哦，它关系到很多细节概率……。”',
			8 => '“开局一步野生阔剑其实是正常现象，总有人得去踩的嘛，比如你？”',
			9 => '“我～还～会～再～回～来～的～”',
			10 => '“爆系根本不需要进行反击率判断，所以如果你看到这句话，说明我当时写代码脑抽了。”',
			11 => '“无法反击是伏击武器的宿命啊！（摔”',
			12 => '“那、那个……就这么说吧！冴冴我喜欢你呀！”（按）',
			13 => '“失手了！不知道坑了多少人的切糕？”',
			'color' => 'yellow'
		)
	),
	24 => Array(
		'测试用鱼装自走兵器' => Array(
			0 => '“表示形态确认，数据处理完成。”',
			1 => '“……”',
			2 => '“将天空燃烧染成深红吧——”',
			3 => '“这段插曲渲染了一去不复返的时光色彩——”',
			4 => '“曾几何时许下与那光芒同在的宏伟——”',
			5 => '“把梦想抱紧的话，就能改变未来，跨越这时空——”',
			6 => '“命运的轨迹，流转着不息——”',
			7 => '“看不到未来，就用手去找寻——”',
			8 => '“偶然也好，幸运也好。”',
			9 => '“有些东西，不靠战争是保护不了的！”',
			10 => '“……”',
			11 => '“两难的境地。”',
			12 => '“深红的烈焰，唤醒沉睡的天空——”',
			13 => '“记住，宇宙的恐怖，个人的渺小，生命的可贵……。”',
			'color' => 'yellow'
		)
	),
	89 => Array(
		'年兽（？）' => Array(
			0 => '“咕咕咕，恭喜发财，新年快乐，咕咕咕，大鹌鹑。”',
			1 => '“咕咕咕，咕咕，我祝你事事顺利，教你做个文明人！”',
			2 => '“ 咕咕咕，咕咕，大鹌鹑”',
			3 => '“咕咕，咕咕咕，我祝你新年快乐”',
			4 => '“咕咕，咕咕咕，我祝你身体健康”',
			5 => '“咕咕，咕咕咕，我祝你财源滚滚”',
			6 => '“咕咕，咕咕咕，我祝你步步高升”',
			7 => '“咕咕，咕咕咕，我祝你学业有成”',
			8 => '“咕咕，我咕你买了个表的”',
			9 => '“呱！”',
			10 => '“咕咕，再见，咕咕，傻逼！”',
			11 => '“咕咕，再见，咕咕，傻逼！”',
			12 => '“呱！呱！呱！”',
			13 => '“下回别这样了，你演的叫这么假观众都看不下去了，中午盒饭没有鸡腿了。”',
			'color' => 'clan'
		)
	),
	13 => Array(
		'卡玛·克莱因' => Array(
			0 => '“幸会，勇敢的挑战者。我是循环的使者卡玛。”',
			1 => '“我的回合。”',
			2 => '“携带备用武器是我的原则。”',
			3 => '“你们管这个叫什么来着？快枪手？”',
			4 => '“你们管这个叫什么来着？二刀流？”',
			5 => '“你们管这个叫什么来着？武器炼金术士？”',
			6 => '“你们管这个叫什么来着？秒间十割……什么来的？”',
			7 => '“武器不好用啊，看来得换把更称手的。”',
			8 => '“依然受伤了？这批人似乎还不赖。”',
			9 => '“干得不错！在新的世界里再会吧，勇敢的挑战者。”',
			10 => '“换武器的时间还需要缩短。”',
			11 => '“用远程武器？懦弱。”',
			12 => '“破绽百出啊！你真的打算认真打么？”',
			13 => '“呵……想要与我们一较高下，你还有得练呢。”',
			'color' => 'yellow'
		),
		'库特' => Array(
			0 => '“哇呼，被发现了吗！？”',
			1 => '“瞄准旁边攻击的话，不会致死的吧……？”',
			2 => '“为了试验，我必须加油了！”',
			3 => '“随便攻击别人是不对的！”',
			4 => '“就算是斯特勒鲁卡，这个时候也会bite a man的！”',
			5 => '“已经满身疮痍了，怎么样才能结束呢……”',
			6 => '“这样下去会出事的啊，快住手吧！”',
			7 => '“好疼好疼，出手太重了啦！”',
			8 => '“就算是试验，也太乱来了……”',
			9 => '“我……我还不能死在这里……还有人在等着我……！”',
			10 => '“哇呼——这就attack过来了啊！？”',
			11 => '“武器的射程，还不够吗？”',
			12 => '“……这样设定的话，应该能成功吧……？”',
			13 => '“这是我必须做的事，给您添麻烦了……”',
			'color' => 'linen'
		),
		'莱卡' => Array(
			0 => '“我似乎沉浸在过去的回忆和相似的人的眷恋里了呢。”',
			1 => '“人类总是在自相残杀……你觉得呢？”',
			2 => '“以前那个不愿意开枪的小女孩，早已被暴徒杀死了。”',
			3 => '“You are a good rival. Counterattack.”',
			4 => '“就没思考过，这种冤冤相报的循环，会导致自灭么？”',
			5 => '“曾经……我也像你一样，有着单纯而快乐的生活。”',
			6 => '“可惜有一天，残酷的命运碾碎了我，就像巨大的机器碾碎变形的齿轮一样。”',
			7 => '“当我再次醒来的时候，属于我的世界已经不存在了。”',
			8 => '“那种踽踽独行的滋味，像你这样的人，难道能理解么！？”',
			9 => '“Dangerous Situation...Retreat.”',
			10 => '“突然袭击呢，很快我们会再会的。”',
			11 => '“射程不足？……怎么会发生这种事？”',
			12 => '莱卡的身后，展开了蝙蝠状的翅膀！<br>“就让你，被牢牢锁死在这濒死的幻想世界里吧，一直到世界崩坏的那一刻……”',
			13 => '“无论是这个世界，还是那个世界，都把你永久放逐了呢。”',
			'color' => 'linen'
		)
	),
	15 => Array(
		'【SANMA_TK】' => Array(
			0 => '“妖精使可能不想对你们下手，但是我不这么想。”',//meet
			1 => '“先收下你的左手！”',//attackfine
			2 => '“试试这个的威力！”',
			3 => '“……你是没办法超过我的速度的！”',
			4 => '“持强凌弱的家伙……百倍奉还！”',
			5 => '“………………？”',//defendfine
			6 => '“你究竟在为何而战？难道也要背上整个世界才能让你明白你的错误么？”',
			7 => '“你确信你是为正确的一方战斗么？还要重复一遍执念造成的错误么？！”',//defendhurt
			8 => '“妖精使这时会怎么说来着……“给我看看大局吧！”不过我觉得你们是看不到了。”',
			9 => '“真是可悲啊……下次让妖精使给一把更好的武器算了。打得不错。”',//retreat
			10 => '“……耍小聪明……”',//can't counterattack
			11 => '“下一次带对器材狙击枪来，对你们不需要任何仁慈。”',//out of range
			12 => '少女的身影从你的面前消失了，正在你不知道如何是好的情况下，你听到你的头顶上传来一声大喝——『别小看人了！』',//critical
			13 => '“妖精使的话是主张击败对手后留一句话是吧，那么……『我愿献吾身，化为盾与枪』，这样算数么？”',	
			'color' => 'yellow'
		),
	),
);
$iteminfo = Array(//注意顺序，AB必须在A的前面，以此类推
	'Ag' => '同志饰物',
	'Al' => '热恋饰物',
	'A'  => '饰物',
	'B' => '电池',
	'C' => '药剂',
	'Ca' => '药剂',
	'Ce' => '药剂',
	'Ci' => '药剂',
	'Cp' => '药剂',
	'Cu' => '药剂',
	'Cw' => '药剂',
	'DN' => '内衣',#内衣
	'DB' => '身体装备',
	'DH' => '头部装备',
	'DA' => '手臂装备',
	'DF' => '腿部装备',
	'EE' => '电脑设备',
	'EW' => '天气控制',
	'ER' => '探测仪器',
	'HH' => '生命恢复',
	'HS' => '体力恢复',
	'HB' => '命体恢复',
	'HM' => '歌魂增加',
	'HT' => '歌魂恢复',
	'GBr' => '机枪弹药',
	'GBi' => '气体弹药',
	'GBh' => '重型弹药',
	'GBe' => '能源弹药',
	'GB' => '手枪弹药',	
	'GP' => '枪械附件',	
	'GSa' => '瞄具',	
	'GSb' => '枪体',	
	'GSe' => '枪管',	
	'GSm' => '弹匣',
	'GSt' => '扳机',	
	'GS' => '枪械组件',		
	'GT' => '精密仪器',	
	'GEM' => '魔法宝石',
	'gbox' => '魔石匣',
	'jew' => '宝石匣',
	'M'=> '强化药物',
	'm' => '金钱道具',
	'N' => '无',	
	'PM' => '歌魂增加',
	'PT' => '歌魂恢复',
	'PH' => '生命恢复',
	'PS' => '体力恢复',
	'PB' => '命体恢复',
	'p' => '礼物',
	'ygo' => '卡包',
	//'R' => '探测仪器',	
	'ss' => '歌词卡片',
	'T' => '陷阱',
	'V'=> '技能书籍',
	'WN' => '空手',#空手
	'WGK' => '枪刃',
	'WCF' => '灵弹',
	'WKF' => '烈刃',
	'WKP' => '暴斩',
	'WCP' => '巨力',
	'WDG' => '重炮',
	'WJ' => '重型枪械',
	'WP' => '钝器',
	'WG' => '远程兵器',
	'WK' => '锐器',
	'WC' => '投掷兵器',
	'WD' => '爆炸物',
	'WF' => '灵力兵器',	
	'WQ' =>'？？？？',
	'XX' =>'杀意已决',
	'XY' =>'杀意未决',
	'X'=> '合成专用',
	'Y' => '特殊',
	'Z' => '特殊',#不可合并
	);
$itemspkinfo = Array(
	'A' => '全系防御',
	'a' => '属性防御',
	'B' => '伤害抹消',
	'b' => '属性抹消',
	'C' => '防投',
	'c' => '重击辅助',
	'D' => '防爆',
	'd' => '爆炸',
	'E' => '绝缘',
	'e' => '电击',	
	'F' => '防符',
	'f' => '灼焰',
	'G' => '防弹',
	'g' => '同志',
	'H' => 'HP制御',
	'h' => '伤害制御',//废弃
	'I' => '防冻',
	'i' => '冻气',
	'J' => '超量素材', //中国玩家没素质
	'j' => '多重',
	'K' => '防斩',
	'k' => '冰华',
	'L' => '致残',
	'l' => '热恋',
	'M' => '陷阱探测',
	'm' => '陷阱迎击',
	'N' => '冲击',
	'n' => '贯穿',
	'O' => '进化',
	'o' => '一发',
	'P' => '防殴',
	'p' => '带毒',
	'q' => '防毒',
	'R' => '混沌伤害',
	'r' => '连击',
	'S' => '消音',
	's' => '调整',
	'T' => '兼容',
	't' => '复位',
	'U' => '防火',
	'u' => '火焰',
	'V' => '诅咒',
	'v' => '灵魂绑定',
	'W' => '隔音',
	'w' => '音波',
	'X' => '直死', //NPC专用
	'x' => '奇迹',
	'Z' => '菁英',
	'z' => '天然',
	'=' => '吸血',
	'|' => '成长',
	'-' => '精神抽取',
	'*' => '灵魂抽取',
	'+' => '技能抽取',
	'^' => '背包',
	);



$shops = Array(0,14,15);
$hospitals = Array(19,25);
$plsinfo = Array(
	0=>'分校',
	1=>'北海岸',
	2=>'北村住宅区',
	3=>'北村公所',
	4=>'邮电局',
	5=>'消防署',
	6=>'观音堂',
	7=>'清水池',
	8=>'白诘草神社',
	9=>'墓地',
	10=>'山丘地带',
	11=>'隧道',
	12=>'西村住宅区',
	13=>'废弃寺庙',
	14=>'废校',
	15=>'灵子研究中心',
	16=>'森林地带',
	17=>'剑塚湖',
	18=>'南村住宅区',
	19=>'诊所',
	20=>'灯塔',
	21=>'南海岸',
	22=>'深渊之口',
	23=>'战术核潜艇',
	24=>'广播塔',
	25=>'凉亭'
);//最后一项不需要带逗号
$xyinfo = Array(
	0=>'D-6',
	1=>'A-2',
	2=>'B-4',
	3=>'C-3',
	4=>'C-4',
	5=>'C-5',
	6=>'C-6',
	7=>'D-4',
	8=>'E-2',
	9=>'E-4',
	10=>'F-6',
	11=>'E-8',
	12=>'F-3',
	13=>'F-9',
	14=>'G-3',
	15=>'G-6',
	16=>'H-4',
	17=>'H-6',
	18=>'I-6',
	19=>'I-7',
	20=>'I-10',
	21=>'J-6',
	22=>'D-8',
	23=>'G-1',
	24=>'I-4',
	25=>'H-8',
);
$areainfo = Array
	(
	0=>"这里是禁区，如果不快点离开，项圈将会爆炸。<br>",
	1=>"向大海望去，只能看到四处巡逻的监视船只。<br>",
	2=>"以前有人在这里居住吧，如今已变成废墟。。<br>",
	3=>"这里是村子的中心吗？现在已经空无一人。<br>",
	4=>"空荡荡的邮局内没有任何东西。<br>",
	5=>"虽说这里是消防站，但是连消防车也没有。<br>",
	6=>"这里供奉着大大小小各种各样的佛像。一到晚上，令人毛骨悚然。<br>",
	7=>"池水十分清澈，也许可以直接饮用。<br>",
	8=>"到处都是人为种植的白诘草，非常茂盛的。<BR>在这里仰望天空的话，总觉得会被某种忧伤的思绪所感染。<br>",
	9=>"这里埋葬着很多被当做祭品杀死的怪兽。<br>不知道是怎样奇怪的召唤仪式呢……<br>",
	10=>"能够一览整个岛的高地。<BR>不过，如果站在这里，被其他人找到的可能性也很高。<br>",
	11=>"真黑暗。<BR>如果在这样的地方被袭击，相信会是非常危险。<br>",
	12=>"这里与其他的住宅街差不多，完全与废墟无异。<br>",
	13=>"完全荒废了的地方。佛像犹如断壁残垣。<br>",
	14=>"长长的坂道的尽头是一所学校。<BR>学校规模不小，但总给人寂寥无人之感。<br><span class=\"yellow\">从校内的自动售货机似乎能买到些什么。</span><br>",
	15=>"曝晒着的牌坊，感觉很凄惨。<br>这个临时建造的研究所，似乎是西边的那座神社的旧址。<br>",
	16=>"浓郁的树叶遮住了阳光，是容易被袭击的地方啊……<br>",
	17=>"这里与其说是湖不如说是沼泽。<br>仔细一看湖底竟然闪烁着斑斑驳驳的金属光辉，<BR>令人毛骨悚然的地方…<br>",
	18=>"与其他住宅区相比，这里的商店特别多。<BR>虽然如此，整个城市弥漫着一种莫名的悲伤的气氛……<br>",
	19=>"巨大的建筑物内，不知名的设备依然在运转。<br>根据残缺不全的说明，<span class=\"yellow\">也许这些机器可以为人治疗伤口和恢复精力？</span><br>",
	20=>"快要成为坚固的城寨了。<BR>地板上有大量的干的血痕。发生了什么？<br>",
	21=>"数艘轮船停靠着。<BR>是士兵和优胜者将要乘坐的船吗？<br>",
	22=>"喷涌着暴戾之气的深不见底的洞窟。<br>若是失足掉下去的话……<br>",
	23=>"有艘并不是本国标志的潜艇停靠在这个地方。<br>看起来并不是友善的存在，探索必须谨慎。<br>",
	24=>"全岛广播似乎由这座戒备森严的塔来支持。<br>那个巫女会在这里吗？<br>",
	25=>"飘来红茶的香气，宁静得让人舒心。<br>你通过竖在附近的告示牌得知这里是非管制地区，<br>允许你使用这里提供的简易医疗设备。<br>但是前提是不能惊扰那位管理员少女……<br>",
);



$dinfo = Array(
	10 => '不知道什么原因，你死去了。<br>这应该是一个BUG，请通知管理员。<br>',
	11 => '“滴滴滴——”<br>这是……手机闹铃的提示音？<br>“糟糕！还没确认这次的禁区情况——”<br>还没等你有所反应，死神一般的空间裂缝已经把你吞没了。<br>等待你的只有死亡……<br>',
	12 => '“呜……到此为止了吗……”<br>毒素造成的痛苦让你无法再坚持下去了。<br>你吐出嘴里最后一点深黑的血液，仰面倒了下去。<br>',
	13 => '“不好！”<br>也许在平时的你看来，这只是小菜一碟……<br>但对于此刻遍体鳞伤的你来说，<br>眼前的突发状况无异于压垮骆驼的最后一根稻草。<br>你不甘心地倒下了，再也没有起来。<br>',
	14 => '“也许咱应该断定你上网成瘾？”<br>这是……林无月的声音！<br>从哪里传来的？<br>她怎么会知道我试图入侵虚拟世界的控制系统？<br>还没等你反应过来，你就两眼一黑，什么都不知道了。<br>',
	15 => '“我很抱歉，不过这是林无月的意思。”<br>面前突然出现的，是一个陌生男子。<br>这人说些什么怪话呢？<br>你正要上前问个究竟，只见男子手中白光一闪，你的意识就此烟消云散。<br>',
	16 => '“我很抱歉，不过这是林无月的意思。”<br>面前突然出现的，是一个陌生男子。<br>这人说些什么怪话呢？<br>你正要上前问个究竟，只见男子手中白光一闪，你的意识就此烟消云散。<br>',
	17 => '“呜……到此为止了吗……”<br>身体已被冰雹砸得千疮百孔，伤痛让你无法再坚持下去了。<br>你脚下一软，向前栽倒，失去了意识。<br>',
	18 => '“呜……到此为止了吗……”<br>烧伤导致的伤痛让你无法再坚持下去了。<br>你脚下一软，向前栽倒，失去了意识。<br>',
	19 => '“呜……到此为止了吗……”<br>随着大量的血液不断的流出，你脚下一软，向前栽倒，失去了意识。<br>',
	20 => '一切……都结束了吧……<br>你无力地倒在地上，<br>眼睁睁地看着血液从致命的伤口喷涌而出。<br>一个挥舞双拳的身影，在你失神的瞳孔中逐渐淡去……<br>',
	21 => '一切……都结束了吧……<br>你无力地倒在地上，<br>眼睁睁地看着血液从致命的伤口喷涌而出。<br>一个紧握钝器的身影，在你失神的瞳孔中逐渐淡去……<br>',
	22 => '一切……都结束了吧……<br>你无力地倒在地上，<br>眼睁睁地看着血液从致命的伤口喷涌而出。<br>一个腰佩刀剑的身影，在你失神的瞳孔中逐渐淡去……<br>',
	23 => '一切……都结束了吧……<br>你无力地倒在地上，<br>眼睁睁地看着血液从致命的伤口喷涌而出。<br>一个扛着枪械的身影，在你失神的瞳孔中逐渐淡去……<br>',
	24 => '一切……都结束了吧……<br>你无力地倒在地上，<br>眼睁睁地看着血液从致命的伤口喷涌而出。<br>一个手持投掷武器的身影，在你失神的瞳孔中逐渐淡去……<br>',
	25 => '一切……都结束了吧……<br>你无力地倒在地上，<br>眼睁睁地看着血液从致命的伤口喷涌而出。<br>一个手持爆炸物的身影，在你失神的瞳孔中逐渐淡去……<br>',
	26 => '“这味道……不对！”<br>饥渴难耐的你才咬了一口手中的补给品，就觉得不对劲。<br>然而，你发现得太晚了……<br>剧毒在几秒钟之内就夺去了你的生命。<br>',
	27 => '“什么！这里竟然……”<br>没能留意到陷阱的你，只能眼睁睁看着轰然启动的陷阱无情地撕碎你的身躯。<br>“啊啊……这是……哪个混蛋……”<br>你的双眼被鲜血永远地掩盖了。<br>',
	28 => '你被很奇怪的事情夺去了生命。<br>也许这跟一个名叫夜什么月的人有一星半点的关系。<br>具体情况请参见游戏状况。<br>',
	29 => '一切……都结束了吧……<br>你无力地倒在地上，<br>眼睁睁地看着血液从致命的伤口喷涌而出。<br>一个攥着符札的身影，在你失神的瞳孔中逐渐淡去……<br>',
	30 => '好奇心果然杀死猫啊……<br>你勉强支起破碎的身躯，<br>看着那个你刚才按下的带按钮的小盒子无奈地笑着。<br>这真是残酷的恶作剧啊。<br>你的意识逐渐模糊了……<br>',
	31 => '注射器里的药液才打进一半，你就觉得身体有异样。<br>“脖子……好痒……”<br>你疯狂地抠着脖子上的淋巴腺，<br>很快就倒在动脉破裂而流出的血泊中……<br>',
	32 => '“就躲在这里，让那些人自相残杀去吧。”<br>你正打着自己的小算盘，却被一声怒喝打断了。<br>“来人，这里有个挂机党！”<br>你惊愕地看着不知从哪里冒出来的玩家们把你团团围住。<br>“浪费时间，快去死吧！”<br>之后的事情，就太猎奇了……<br>',
	33 => '“对不起、对不起！能让我迫降一下吗？”<br>勉强躲过弹幕的你，忽然听到头上传来这样焦急的道歉声。<br>少女的迫降……？莫非是指……<br>少女娇柔的话音让你放松了警惕。<br>还没等你反应过来，少女——以及她乘坐的、几十吨重的机体——便把你的整个世界压得粉碎……<br>',
	34 => '将手中的溶剂一饮而尽之后，你感到全身就像燃烧起来一样。<br>“没错，我需要的就是这种力量！”<br>然而，当你看到自己像奶油般融化了的手掌在地上扑腾的时候，你才发现这场豪赌押错了边。<br>“那么，你就燃烧殆尽吧。”在意识崩解前，传来了一个女声的叹息。<br>',
	35 => '在你失去意识之前，你仿佛听到了一个冰冷的声音。<br>“像你这样的Homo-Speculator……”<br>“……真是最差劲的个体了”<br>然后，你看着你的身体和意识在一道圣光中溶解了。<br>',
	36 => '你徒劳地想挣脱丝带的束缚，<br>但是从丝带上传来的巨大压力，简简单单地将你一分两半。<br>真是杂鱼一样的死法……<br>',
	37 => '你徒劳地想躲避丝带，<br>但是说时迟那时快，你发现你的头正在骨碌碌地往山脚下滚去。<br>真是杂鱼一样的死法……<br>',
	38 => '你成功地躲避了丝带，<br>没想到从丝带中竟然喷出了岩浆！<br>你的意识在烈火中消失了。<br>',
	39 => '“去死吧！就算你是权限[哔]也挡不住我这一击的！”<br>你狂笑着使出你自认为决定胜负的一击，噗通倒下的却是你自己。<br>“不，这不科学！”被武器背叛的你遁入了无尽的黑暗中。<br>',
	40 => '“看起来好像没什么反应嘛……那是！！”<br>天空中突然降下的巨大柱状物瞬间将你的世界吞没。<br>你眼前一黑，便失去了意识。<br>',
	41 => '“去死吧！就算你是权限[哔]也挡不住我这一击的！”<br>你的队友挥舞着手中的武器，狂妄的喊着。<br><br>“诶？ 这武器上写的是…… 直死……？”<br>发现事情不对的你冲上前去，试图阻止队友的举动，但已经太迟了。<br>队友手中的武器仿佛变成了黑洞，只一瞬间就把你们都吞没了。<br>',
	42 => '你暴风骤雨般的攻击将对方打得毫无还手之力，正当你欺身向前，准备了结对方的性命时，对方忽然振臂高呼：<br><span class="clan">“安拉胡阿克巴！”</span><br>你这才发现对方腰间绑着一排明晃晃的炸药，但他已猛地扑了上来。剧烈的爆炸一瞬间就夺去了你的生命。',
	43 => '你被对方暴风骤雨般的攻击打得毫无还手之力。对方欺身向前，准备了结你的性命。你不甘就这么死去，振臂高呼到：<br><span class="clan">“安拉胡阿克巴！”</span><br>对方这才发现你腰间绑着一排明晃晃的炸药。<br>你用尽最后的力气拉响了引线，猛地扑了上去。剧烈的爆炸一瞬间就夺去了你的生命。',
	44 => '<span class="yellow">“嗑哒……”</span><br>突然，你听见了一个细微的金属碰撞声音。<br><span class="clan">“糟糕…… 难道……”</span><br>还没反应过来，陷阱就在你手中爆炸了。<br>果然还是技术不过硬啊……<br>你无奈地哀叹着，永远地闭上了眼睛。',
	45 => '天空中仿佛有什么东西正在发出眩目的红光，整个大地都被照成了红色。<br>你疑惑地望向天空，不知道发生了什么。<br>只见远处的天空中，一颗明亮的星星，渐渐显露出来。<br>定睛看去，那其实不是星星，是飞行器一般的东西，正高速划破天空，身后留下清晰可见的尾迹。<br>高速飞行的东西已经很近了，圆锥形的脑袋在阳光下反射着耀眼的金光。<br>就在那一瞬间，整个岛屿便被千万倍亮于太阳的刺眼光芒所淹没了……<br>',
	46 => '鱼形的生物向你吐出一枚炸弹，你躲闪不及，被炸了个正着，但却毫发无损。<br>正当你想露出不屑的笑容嘲讽对方时，你听到了像是秒表归零的声音。<br>猛烈的爆炸从你身体的内部发出，你被无尽的烈焰吞噬了。<br>',
	47 => '你正挥动手中被诅咒的武器肆意杀戮着，享受着失败者灵魂的悲鸣。<br>一阵剧烈的痛苦毫无征兆的从你的心口传来，你不自觉的发出了一声凄厉的尖叫。<br>黑暗蒙上了你的双目，你却清晰的看到无数双鲜血淋漓的手向你伸来，你的意识在无尽的痛苦之中就此消散了……<br>',
);

$syschatinfo = Array(
	'hack' => Array(
		Array('r0','米可','哼，真有两下子……等下次禁区自动恢复好了。'),
		//Array('r0','红暮','大胆狂徒，再敢这样做小心我直接改你的RP值。'),
		//Array('r0','红暮','满是雪花的屏幕还真让人心烦。'),
		Array('r0','米可','禁区失效了诶。是冲着米可酱而来的吗，好好奉陪才行。'),
		Array('b0','米可','禁区被解除了？……'),
		//Array('b0','蓝凝','似乎可以从显示屏上看出弹幕来……'),
		Array('b0','米可','咦？不是吧！练习灵力武器会干扰到机器信号吗……'),
	),
	'rdown' => Array(
		Array('b0','蓝凝','刚才那声音是……难道？'),
		Array('b0','蓝凝','...Engage, Rage mode-魔法特工 苍蓝☆乱舞！'),
	),
	'bdown' => Array(
		Array('r0','红暮','你们对我妹妹做了什么！？'),
		Array('r0','红暮','凝酱……是嘛，看来有碍事的家伙出现了。'),
	),
	'areawarn20' => Array(
		Array('r0','米可','咳咳，那么下面播报禁区警告——'),
		Array('r0','米可','如果不提示，会有多少人阴沟里翻船呢？不过米可酱可没那么坏心眼啦……'),
		Array('r0','米可','广播系统好像有点失灵？谁都好，快来修一下吧。'),
		//Array('b0','蓝凝','这里是……警报。'),
		//Array('b0','蓝凝','NOW THE ALARM.'),
	),
	'areawarn40' => Array(
		Array('r0','米可','白热化！连斗阶段真是美丽啊。'),
		Array('r0','米可','再过不久就要决出胜者了呢。'),
		Array('r0','米可','似乎还留着几个重要地点，真遗憾。要不要找几个巫女去围堵一下呢？'),
		//Array('r0','红暮','那边的职人，对就是你们几个，没死的话过来帮忙把这个陷阱挪走。'),
		Array('b0','米可','诶诶！……差点忘报了……'),
		Array('b0','米可','啊～真无聊，小幸完全不联络人家……呃，在、在播报啊，现在是警报时间——'),
		//Array('r1b0','蓝凝','那家伙撤退了，我得加油……'),
	),
	'areaadd20' => Array(
		Array('r0','米可','听啊，那丧钟为谁而鸣……噗哈哈哈，人家不想念这么中二的演讲稿啦！'),
		Array('r0','米可','现在增加禁区。'),
		Array('r0','米可','各位好，这里是人见人爱的米可酱，我们先来看看本期的禁区死亡名单——'),
		//Array('r0b0','红暮','就这几个人么……凝酱，你怎么看？'),
		Array('b0','米可','禁区时间到！'),
		Array('b0','米可','按下按钮就可以了吗？人家不是很懂这些机器诶……'),
		//Array('b0','蓝凝','GENOCIDE IS COMING.'),
	),
	'areaadd40' => Array(
		Array('r0','米可','现在死掉就没法投币了哦！大概是这样的游戏术语？'),
		//Array('r0','红暮','正在奋战的各位辛苦了，下面给你们派发便当。'),
		Array('r0','米可','各位好，现在战斗已经进入高潮，我们来看看这次的禁区死亡名单——'),
		//Array('r0b1','红暮','就用你们的血为凝酱报仇雪恨！'),
		//Array('b0','蓝凝','DEVILRY IS COMING.'),
		//Array('b0','蓝凝','按键无效啊，那么看我的720度回旋斜踢电器维修法！咣——'),
		//Array('r1b0','蓝凝','不会让那家伙失望的……'),
	),
	'end1' => Array(
		Array('r0b0','红暮','没有结果呢。凝酱，准备『下一轮』吧。'),
		Array('r0b0','红暮','预想之中。那么，凝酱，我们从这里撤离吧。'),
		Array('b0','蓝凝','这局真无聊啊。'),
		Array('r1b0','红暮','看来我死得毫无价值呢。凝酱，准备『下一轮』吧。'),
		Array('r1','红暮','看来我死得毫无价值呢。那么，你们就永远留在这里吧。'),
		Array('b1','蓝凝','……真遗憾呢。'),
	),
	'end2' => Array(
		Array('r0','红暮','决出胜负了。欢迎来到胜者的世界。'),
		Array('r0','红暮','竟然是你……不，并没有别的意思。祝贺你，获胜者。'),
		Array('b0','蓝凝','正统派的结局么……'),
		Array('r1','红暮','于是似乎碰到了不按牌理出牌的家伙呢。'),
		Array('b1','蓝凝','...'),
	),
	'end3' => Array(
		Array('r0','红暮','咦，我还活着？这不科学！'),
		Array('r1','红暮','哼……竟然遇到愚蠢到出手反抗的家伙了啊。'),
		Array('r1','红暮','你觉得你真的能逃脱么？'),
		Array('r1','红暮','那就让你达成所谓的HAPPY ENDING吧，呵呵呵……'),
		Array('r1b1','红暮','看来还真是心狠手辣的家伙，我会记住的。'),
		Array('r1b1','红暮','看来还真是心狠手辣的家伙，我会记住的。'),
		Array('b0','蓝凝','正统派的结局么……'),
		
		Array('b1','蓝凝','...'),
	),
);

$gametypedescription = Array(
	0 => '常规局',
	1 => '<span class="yellow">SOLO局</span>',
	2 => '<span class="L5">团战</span>',
);

/*Infomations*/
$_INFO = Array(
	'reg_success' => '注册成功！请返回首页登陆游戏。',
	'pass_success' => '修改密码成功。',
	'pass_failure' => '未修改密码。',
	'data_success' => '接受对帐户资料的修改。',
	'data_failure' => '未修改帐户资料。',
	'credits_conflicts' => '转换冲突，请勿同时转换不同类型积分。',
	'credits_success' => '积分转换成功。',
	'credits_failure' => '积分转换失败，请检查输入。',
	'credits_failure2' => '积分转换失败，请勿输入过大的数字。',
	'credits_failure3' => '积分转换失败，转换战斗力时请输入100的倍数。',
);

/*Error settings*/
$_ERROR = Array(
	'db_failure' => '数据库读写异常，请重试或通知管理员',
	'name_not_set' => '用户名不能为空，请检查用户名输入',
	'name_too_long' => '用户名过长，请检查用户名输入',
	'name_invalid' => '用户名含有非法字符，请检查用户名输入',
	'name_banned' => '用户名含有违禁用语，请检查用户名输入',
	'name_exists' => '用户名已被注册，请更换用户名',
	'pass_not_set' => '密码不能为空，请检查密码输入',
	'pass_not_match' => '两次输入的密码不一致，请检查密码输入',
	'pass_too_short' => '密码过短，请检查密码输入',
	'pass_too_long' => '密码过长，请检查密码输入',
	'ip_banned' => '此IP已被封禁，请与管理员联系',
	'logged_in' => '用户已登录，请先退出登陆再注册',
	'user_not_exists' => '用户不存在，请检查用户名输入',
	
	'no_login' => '用户未登陆，请从首页登录后再试',
	'login_check' => '用户信息验证失败，请清空缓存后再试',
	'login_time' => '登录间隔时间过长，请重新登录后再试',
	'login_info' => '用户信息不正确，请清空缓存和Cookie后进入游戏',
	'player_limit' => '本局游戏参加人数已达上限，无法进入，请下局再来',
	'wrong_pw' => '用户名或密码错误，请检查输入',
	'player_exist' => '角色已经存在，请不要重复激活',
	'no_start' => '游戏尚未开始，请稍后再试',
	'valid_stop' => '本游戏已经停止激活，无法进入，请下局再来',
	'user_ban' => '此账号禁止进入游戏，请与管理员联系',
	'scripter_ban' => '如果你看到我，说明你的帐号已经被封禁了，请与管理员联系',
	'no_admin' => '你不是管理员，不能使用此功能',
	'ip_limit' => '本局此IP激活人数已满，请下局再来',
	'no_power' => '你的管理权限不够，不能进行此操作',
	'wrong_adcmd' => '指令错误，请重新输入',
	//'invalid_name' => '用户名含有非法字符，请重新输入',
	//'banned_name' => '用户名含有违禁用语，请更改用户名',
	//'banned_ip' => '此IP已被封禁，请与管理员联系',
	//'long_name' => '用户名过长，请重新输入用户名'
);
//魔法宝石
$gemstateinfo=Array(
	1 => '<span class="yellow">未激活</span>',
	2 => '<span class="red">已激活</span>',
	3 => '<span class="grey">封印中</span>',
	4 => '<span class="clan">冷却中</span>',
	5 => '<span class="yellow">需主动激活</span>',
);
$gemlvlinfo=Array(
	0 => '<span class="red">Lv.0</span>',
	1 => '<span class="red">Lv.1</span>',
	2 => '<span class="red">Lv.2</span>',
	3 => '<span class="L5">Lv.max</span>',
);
$gemweponinfo=Array('☆青金石法杖☆','☆翠榴石战刃☆','☆琥珀石重锤☆','☆红宝石投枪☆','☆黑曜石灵弹☆','☆猫眼石火铳☆');
$gemweptwinfo=Array('★青金石黎扎路★','★翠榴石笛孟德★','★琥珀石欧贝尔★','★红宝石洛铂尼★','★黑曜石沃裴德★','★猫眼石凯艾尔★');
$gemweptrinfo=Array('□青金石拉帕萨□','□翠榴石拓洛尔□','□琥珀石安泊雅□','□红宝石瑞拉安□','□黑曜石欧第斯□','□猫眼石卡托思□');
$gemwepfoinfo=Array('■青金石费阿■','■翠榴石艾雅■','■琥珀石尼萨■','■红宝石费洛■','■黑曜石拉泊■','■猫眼石索汀■');
$gemwepinfo=Array('＜上灵＞','＜时刃＞','＜船桨＞','＜棘枪＞','＜厄环＞','＜夜母＞');
//枪械组件
$normal_gun=Array('普通枪械枪体','短节枪管','机械瞄具');
$sniper_gun=Array('重型枪械枪体','长节枪管','全息瞄具');
$knife_gun=Array('扁长式枪体','带刃滑膛枪管','反射式瞄具');
$cannon_gun=Array('重型枪炮枪体','巨炮枪管','内红点瞄具');
$gun_k=Array(
	'普通枪械枪体' => 'GSb',
	'重型枪械枪体' => 'GSb',
	'扁长式枪体' => 'GSb',
	'重型枪炮枪体' => 'GSb',
	'短节枪管' => 'GSe',
	'长节枪管' => 'GSe',
	'带刃滑膛枪管' => 'GSe',
	'巨炮枪管' => 'GSe',
	'机械瞄具' => 'GSa',
	'全息瞄具' => 'GSa',
	'反射式瞄具' => 'GSa',
	'内红点瞄具' => 'GSa',
	'普通弹匣' => 'GSm',
	'重型弹匣' => 'GSm',
	'气体弹仓' => 'GSm',
	'能源电池' => 'GSm',
	'单发式扳机' => 'GSt',
	'连发式扳机' => 'GSt',
);
$gun_body=Array(
	'WG' => '普通枪械枪体',
	'WJ' => '重型枪械枪体',
	'WGK' => '扁长式枪体',	
	'WDG' => '重型枪炮枪体',	
);
$gun_barrel=Array(
	'WG' => '短节枪管',
	'WJ' => '长节枪管',
	'WGK' => '带刃滑膛枪管',
	'WDG' => '巨炮枪管',
);
$gun_aiming=Array(
	'WG' => '机械瞄具',
	'WJ' => '全息瞄具',
	'WGK' => '反射式瞄具',
	'WDG' => '内红点瞄具',
);
$gun_trigger=Array(
	0 => '单发式扳机',
	1 => '连发式扳机',
);
$gun_ammo=Array(
	0 => '普通弹匣',
	1 => '重型弹匣',
	2 => '气体弹仓',
	3 => '能源电池',
);
$gun_other=Array(
	'S' => '消音器',
	'R' => '弹道校准器',
	'c' => '高速推进器',
	'd' => '榴弹发射器',
	'u' => '燃烧曳光弹改造装置',
	'i' => '液态速凝弹改造装置',
	'w' => '高频音爆弹改造装置',
	'e' => '电磁脉冲弹改造装置',
	'N' => 'PSR子弹排列蓄能装置',
	'r' => '选择火力快速射击装置',
	'n' => 'FMJ金属被甲弹改造装置',
	'' => '枪械增幅设备',
);
$gunnameA=Array('拂晓的','惨痛的','恐惧的','强大的','致命的','卑微的','下流的','光芒的','血色的','猛烈的','撕裂的','黄金的','洁白的','放肆的');
$gunnameB=Array('妹妹之','魔术师之','太阳之','倒吊者之','愚者之','风之','旅人之','勇者之','平民之','不可说之','仆从之','隐者之','猫之','友情之');
$gunnameC=Array('恒星','蔷薇','微光','吞噬者','不屈魂','暗流','北极','逆潮','胖次','劲弩','凛风','林中人','灯笼裤','服务器');

$ach_text = Array(
	0 => Array(
		'img'=> Array(0 => 'achievement_not_done.gif', 1=> 'achievement_0.gif'),
		'state' => Array (0 => 0, 1=> 10, 2=> 10, 999=>20),  //0 未完成   10 进行中   20 完成
		'type' => 'mixitem',
		'title' => Array(
			0=>'永恒世界的住人',
			1=>'幻想世界的往人',
			2=>'永恒的覆唱'
		),
		'prc' => '合成次数 %s 次',
		'need' => Array(
			0=>'合成物品【KEY系催泪弹】1次',
			1=>'合成物品【KEY系催泪弹】5次',
			2=>'合成物品【KEY系催泪弹】30次'
		),
		'reward' => Array(
			0=>'切糕10',
			1=>'积分200 切糕300 <span class="evergreen">称号 幻想</span>',
			2=>'积分700 切糕1000 <span class="evergreen">称号 流星</span>'
		)
	),
	1 => Array(
		'img'=> Array(0 => 'achievement_not_done.gif', 1=> 'achievement_0.gif'),
		'state' => Array (0 => 0, 1=> 20),
		'type' => 'other',
		'title' => Array(
			0=>'清水池之王'
		),
		'prc' => '最快速度： %s 秒',
		'need' => Array(
			0=>'在开局5分钟内合成物品【KEY系催泪弹】'
		),
		'reward' => Array(
			0=>'积分30 切糕16 <span class="evergreen">称号 KEY男</span>'
		)
	),
	2 => Array(
		'img'=> Array(0 => 'achievement_not_done.gif', 1=> 'achievement_0.gif'),
		'state' => Array (0 => 0, 1=> 10, 2=> 10, 999=>20),  //0 未完成   10 进行中   20 完成
		'type' => 'battle',
		'title' => Array(
			0=>'Run With Wolves',
			1=>'Day Game',
			2=>'Thousand Enemies'
		),
		'prc' => '合成次数： %s 次',
		'need' => Array(
			0=>'在自己的行动中击杀10名玩家',
			1=>'在自己的行动中击杀100名玩家',
			2=>'在自己的行动中击杀1000名玩家'
		),
		'reward' => Array(
			0=>'积分10',
			1=>'积分500 切糕200 <span class="evergreen">称号 二度打</span>',
			2=>'切糕2000 <span class="evergreen">称号 G.D.M</span>'
		)
	),
	3 => Array(
		'img'=> Array(0 => 'achievement_not_done.gif', 1=> 'achievement_0.gif'),
		'state' => Array (0 => 0, 1=> 10, 2=> 10, 999=>20),  //0 未完成   10 进行中   20 完成
		'type' => 'battle',
		'title' => Array(
			0=>'脚本小子',
			1=>'黑客',
			2=>'幻境解离者？'
		),
		'prc' => '击杀总数： %s 名',
		'need' => Array(
			0=>'击杀100名NPC',
			1=>'击杀1000名NPC',
			2=>'击杀10000名NPC'
		),
		'reward' => Array(
			0=>'切糕5',
			1=>'积分200 <span class="evergreen">称号 黑客</span>',
			2=>'积分500 切糕1500 <span class="evergreen">称号 最后一步</span>'
		)
	),
	4 => Array(
		'img'=> Array(0 => 'ach/N.gif', 1=> 'ach/D.gif', 999=>'ach/4_1.gif'),
		'state' => Array (0 => 0, 1=> 10, 999=>20),  //0 未完成   10 进行中   20 完成
		'type' => 'battle',
		'title' => Array(
			0=>'冒烟突火',
			1=>'红杀将军'
		),
		'prc' => '推倒次数： %s 次',
		'need' => Array(
			0=>'推倒红暮1次',
			1=>'推倒红暮9次'
		),
		'reward' => Array(
			0=>'积分50 切糕75',
			1=>'<span class="evergreen">称号 越红者</span>'
		)
	),
	5 => Array(
		'img'=> Array(0 => 'achievement_not_done.gif', 1=> 'achievement_0.gif'),
		'state' => Array (0 => 0, 1=> 20),
		'type' => 'undefined',
		'title' => Array(
			0=>'自作孽不可活'
		),
		'prc' => '死亡次数： %s 次',
		'need' => Array(
			0=>'因触发了自己设置的陷阱而死亡1次'
		),
		'reward' => Array(
			0=>'积分10 切糕5'
		)
	),
	6 => Array(
		'img'=> Array(0 => 'achievement_not_done.gif', 1=> 'achievement_0.gif'),
		'state' => Array (0 => 0, 1=> 20),
		'type' => 'undefined',
		'title' => Array(
			0=>'野生君的邂逅'
		),
		'prc' => '死亡次数： %s 次',
		'need' => Array(
			0=>'因触发了陷阱 ★全地图唯一的野生高伤阔剑地雷★ 而死亡1次'
		),
		'reward' => Array(
			0=>'积分10 切糕15'
		)
	),
	7 => Array(
		'img'=> Array(0 => 'achievement_not_done.gif', 1=> 'achievement_0.gif'),
		'state' => Array (0 => 0, 1=> 20),
		'type' => 'undefined',
		'title' => Array(
			0=>'野生君的暗恋'
		),
		'prc' => '遭遇次数： %s 次',
		'need' => Array(
			0=>'遭遇陷阱 ★全地图唯一的野生高伤阔剑地雷★ 8次'
		),
		'reward' => Array(
			0=>'积分50 切糕120'
		)
	),
	8 => Array(
		'img'=> Array(0 => 'achievement_not_done.gif', 1=> 'achievement_0.gif'),
		'state' => Array (0 => 0, 1=> 20),
		'type' => 'undefined',
		'title' => Array(
			0=>'这么死也值了！'
		),
		'prc' => '死亡次数： %s 次',
		'need' => Array(
			0=>'因触发陷阱 ★一发逆转神话★ 而死亡1次'
		),
		'reward' => Array(
			0=>'积分10 切糕10'
		)
	),
	9 => Array(
		'img'=> Array(0 => 'achievement_not_done.gif', 1=> 'achievement_0.gif'),
		'state' => Array (0 => 0, 1=> 20),
		'type' => 'undefined',
		'title' => Array(
			0=>'对下雷者的“大打击”'
		),
		'prc' => '完成次数： %s 次',
		'need' => Array(
			0=>'在最大血量小于850时，中了陷阱 ☆★☆大打击☆★☆ 却未死亡1次'
		),
		'reward' => Array(
			0=>'积分30 切糕15'
		)
	),
	10 => Array(
		'img'=> Array(0 => 'achievement_not_done.gif', 1=> 'achievement_0.gif'),
		'state' => Array (0 => 0, 1=> 20),
		'type' => 'undefined',
		'title' => Array(
			0=>'救命的迎击'
		),
		'prc' => '迎击成功次数： %s 次',
		'need' => Array(
			0=>'利用 陷阱迎击 属性成功迎击高伤陷阱（大于1000效）1次'
		),
		'reward' => Array(
			0=>'积分15 切糕15'
		)
	),
	11 => Array(
		'img'=> Array(0 => 'achievement_not_done.gif', 1=> 'achievement_0.gif'),
		'state' => Array (0 => 0, 1=> 20),
		'type' => 'undefined',
		'title' => Array(
			0=>'真·地雷磁铁'
		),
		'prc' => '遭遇次数： %s 次',
		'need' => Array(
			0=>'遭遇400次陷阱'
		),
		'reward' => Array(
			0=>'积分100 切糕100'
		)
	),
	12 => Array(
		'img'=> Array(0 => 'achievement_not_done.gif', 1=> 'achievement_0.gif'),
		'state' => Array (0 => 0, 1=> 20),
		'type' => 'undefined',
		'title' => Array(
			0=>'DeathNoter'
		),
		'prc' => '完成次数： %s 次',
		'need' => Array(
			0=>'使用野生的 ■DeathNote■ 杀死一名玩家'
		),
		'reward' => Array(
			0=>'积分30 切糕30'
		)
	),
	13 => Array(
		'img'=> Array(0 => 'ach/N.gif', 1=> 'ach/D.gif', 999=>'ach/13_1.gif'),
		'state' => Array (0 => 0, 1=> 10, 999=>20),  //0 未完成   10 进行中   20 完成
		'type' => 'battle',
		'title' => Array(
			0=>'深度冻结',
			1=>'跨过彩虹'
		),
		'prc' => '推倒次数： %s 次',
		'need' => Array(
			0=>'推倒蓝凝1次',
			1=>'推倒蓝凝3次'
		),
		'reward' => Array(
			0=>'积分150 切糕250',
			1=>'<span class="evergreen">称号 跨过彩虹</span>'
		)
	),
	14 => Array(
		'img'=> Array(0 => 'achievement_not_done.gif', 1=> 'achievement_0.gif'),
		'state' => Array (0 => 0, 1=> 10, 2=> 10, 999=>20),  //0 未完成   10 进行中   20 完成
		'type' => 'itemmix',
		'title' => Array(
			0=>'篝火的引导',
			1=>'世界的树形图',
			2=>'地=月'
		),
		'prc' => '合成次数： %s 次',
		'need' => Array(
			0=>'合成物品【KEY系燃烧弹】1次',
			1=>'合成物品【KEY系燃烧弹】5次',
			2=>'合成物品【KEY系燃烧弹】30次'
		),
		'reward' => Array(
			0=>'切糕10',
			1=>'积分200 切糕300 <span class="evergreen">称号 树形图</span>',
			2=>'积分700 切糕1000 <span class="evergreen">称号 TERRA</span>'
		)
	),
);
?>
